lighttransport/gemm/rdna4/sam3d/hip_sam3d_runner.c
/* HIP/ROCm runner for FAIR's SAM 3D Objects — Phase 0 scaffold.
 *
 * What's wired right now:
 *   - rocew runtime + HIPRTC compile bring-up (sentinel kernel).
 *   - Per-module safetensors directory resolution (explicit override or
 *     pipeline_yaml sibling fallback).
 *   - Public API stubs: every hip_sam3d_run_* and hip_sam3d_get_* is
 *     callable; each returns HIP_SAM3D_E_NOT_IMPLEMENTED until its
 *     stage lands.
 *   - Debug overrides hold pytorch ref tensors on host; later stages
 *     consume them once the corresponding kernels go live.
 *
 * Subsequent phases bring in real kernels in the order:
 *   1. DINOv2-L/14+reg encoder      (mirror cuda/sam3d_body's DINOv3 path)
 *   2. CondEmbedderFuser            (Llama SwiGLU + concat)
 *   3. SS Flow DiT (shortcut ODE)   (mirror cuda/trellis2's DiT)
 *   4. SS-VAE 3D-conv decoder
 *   5. SLAT Flow DiT (shift-window)
 *   6. SLAT GS decoder + PLY emit
 *
 * Reference numerics live in /tmp/sam3d_ref/ (from
 * ref/sam3d/gen_image_ref.py); each stage gets a verify_*.c that diffs
 * against the same dumps the CPU runner uses.
 */

#include "hip_sam3d_runner.h"
#include "../rocew.h"
#define HIP_RUNNER_COMMON_IMPLEMENTATION
#include "../hip_runner_common.h"

#include "hip_sam3d_kernels.h"

#define SAFETENSORS_IMPLEMENTATION
#include "../../common/safetensors.h"

#define HIP_SAM3D_DINOV2_GPU_IMPLEMENTATION
#include "hip_sam3d_dinov2_gpu.h"
#include "hip_sam3d_dinov2_forward.h"
#define HIP_SAM3D_PPE_GPU_IMPLEMENTATION
#include "hip_sam3d_ppe_gpu.h"
#include "hip_sam3d_ppe_forward.h"
#define HIP_SAM3D_FUSER_GPU_IMPLEMENTATION
#include "hip_sam3d_fuser_gpu.h"
#include "hip_sam3d_fuser_forward.h"
#define HIP_SAM3D_SSDIT_GPU_IMPLEMENTATION
#include "hip_sam3d_ssdit_gpu.h"
#undef  HIP_SAM3D_SSDIT_GPU_IMPLEMENTATION
#define HIP_SAM3D_SSDIT_FORWARD_IMPLEMENTATION
#include "hip_sam3d_ssdit_forward.h"
#undef  HIP_SAM3D_SSDIT_FORWARD_IMPLEMENTATION
#define HIP_SAM3D_SSDIT_OUTER_IMPLEMENTATION
#include "hip_sam3d_ssdit_outer.h"
#undef  HIP_SAM3D_SSDIT_OUTER_IMPLEMENTATION
#define HIP_SAM3D_SS_DECODER_GPU_IMPLEMENTATION
#include "hip_sam3d_ss_decoder_gpu.h"
#undef  HIP_SAM3D_SS_DECODER_GPU_IMPLEMENTATION
#define HIP_SAM3D_SS_DECODER_FORWARD_IMPLEMENTATION
#include "hip_sam3d_ss_decoder_forward.h"
#undef  HIP_SAM3D_SS_DECODER_FORWARD_IMPLEMENTATION
#define HIP_SAM3D_SLAT_DIT_GPU_IMPLEMENTATION
#include "hip_sam3d_slat_dit_gpu.h"
#undef  HIP_SAM3D_SLAT_DIT_GPU_IMPLEMENTATION
#define HIP_SAM3D_SLAT_DIT_FORWARD_IMPLEMENTATION
#include "hip_sam3d_slat_dit_forward.h"
#undef  HIP_SAM3D_SLAT_DIT_FORWARD_IMPLEMENTATION
#include "../../common/sam3d_shortcut_solver.h"
#include "../../common/sam3d_gs_decoder.h"
#include "sam3d_cpu.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#if defined(_OPENMP)
#include <omp.h>
#endif

/* ===== context state ===== */

typedef struct {
    int      n;
    int      c;
    float   *data;       /* host, malloc'd */
} cs3d_host_2d;

typedef struct {
    int      ndim;
    int      dims[4];
    float   *data;       /* host, malloc'd */
} cs3d_host_nd;

typedef struct {
    int      n, c;
    float   *feats;      /* host, malloc'd */
    int32_t *coords;     /* host, malloc'd */
} cs3d_host_slat;

typedef struct {
    hipDeviceptr_t norm1_w, norm1_b;
    hipDeviceptr_t conv1_w, conv1_b;
    hipDeviceptr_t conv2_w, conv2_b;
    hipDeviceptr_t emb_w, emb_b;
    hipDeviceptr_t skip_w, skip_b;
    int C_in, C_out;
    int updown, has_skip;
} cs3d_slat_io_block_gpu;

typedef struct {
    cs3d_slat_io_block_gpu input[2];
    cs3d_slat_io_block_gpu output[2];
    hipDeviceptr_t input_w, input_b;
    int input_in, input_out;
    hipDeviceptr_t out_w, out_b;
    int out_in, out_out;
    size_t total_bytes;
    int loaded;
} cs3d_slat_io_gpu;

typedef struct {
    hipFunction_t gemm, down, up, idx, ln, silu, conv, modln, resadd;
    int loaded;
} cs3d_slat_io_fns;

typedef struct {
    hipDeviceptr_t d_in_coords, d_in_feats;
    hipDeviceptr_t d_coords, d_base;
    hipDeviceptr_t d_counts, d_outN;
    hipDeviceptr_t d_index;
    hipDeviceptr_t d_t, d_t_silu, d_emb;
    hipDeviceptr_t d_skip, d_h1, d_h2, d_h3, d_h4;
    size_t cap_in_coords, cap_in_feats;
    size_t cap_coords, cap_base;
    size_t cap_counts, cap_outN;
    size_t cap_index;
    size_t cap_t, cap_t_silu, cap_emb;
    size_t cap_skip, cap_h1, cap_h2, cap_h3, cap_h4;
} cs3d_slat_io_ws;

typedef struct {
    hipDeviceptr_t qkv_w, qkv_b;
    hipDeviceptr_t out_w, out_b;
    hipDeviceptr_t fc1_w, fc1_b;
    hipDeviceptr_t fc2_w, fc2_b;
} cs3d_gs_mlp_block_gpu;

typedef struct {
    hipDeviceptr_t input_w, input_b;
    hipDeviceptr_t out_w, out_b;
    cs3d_gs_mlp_block_gpu *mlp_blocks;
    int input_in, input_out;
    int out_in, out_out;
    int n_mlp_blocks, mlp_dim, mlp_hidden;
    size_t total_bytes;
    int loaded;
} cs3d_gs_head_gpu;

typedef struct { int64_t key; int idx; } cs3d_gs_win_kv;
typedef struct { int start; int len; } cs3d_gs_win_run;

typedef struct {
    hipDeviceptr_t d_coords, d_in, d_h, d_ln, d_out;
    hipDeviceptr_t d_qkv, d_fwd, d_attn, d_q, d_k, d_v, d_win, d_mlp;
    size_t cap_coords, cap_in, cap_h, cap_ln, cap_out;
    size_t cap_qkv, cap_fwd, cap_attn, cap_q, cap_k, cap_v, cap_win, cap_mlp;
} cs3d_gs_head_ws;

struct hip_sam3d_ctx {
    hip_sam3d_config cfg;
    char    *safetensors_dir_resolved;

    /* cuew + NVRTC. */
    int          device_id;
    int          sm;
    hipModule_t  mod;
    hipFunction_t fn_sentinel;
    int          compiled;

    /* Inputs. */
    uint8_t *img_rgba;   int img_w, img_h;
    uint8_t *mask_u8;    int msk_w, msk_h;
    float   *pmap_f32;   int pmap_w, pmap_h;

    /* Debug-override host buffers (kept until consumed). */
    cs3d_host_2d   ovr_dinov2;
    cs3d_host_2d   ovr_cond;
    cs3d_host_nd   ovr_ss_latent;
    cs3d_host_nd   ovr_occupancy;
    cs3d_host_slat ovr_slat;

    /* Stage outputs (Phase 1a uses CPU fallback; host mirror kept so
     * verify_*.c can read back without a D2H round-trip until real
     * kernels land). */
    sam3d_cpu_dinov2 *cpu_dinov2;
    cs3d_host_2d      dinov2_tokens;
    hipDeviceptr_t       d_dinov2_tokens;   /* device mirror, [n_tok × dim] f32 */

    /* Phase 1b GPU DINOv2 forward — lazy-init on first run_dinov2 call. */
    cs3d_dinov2_gpu      gpu_dinov2;
    int                  gpu_dinov2_loaded;
    cs3d_dinov2_fns      gpu_dinov2_fns;
    cs3d_dinov2_block_ws gpu_dinov2_ws;
    int                  gpu_dinov2_ws_alloced;

    sam3d_cpu_fuser  *cpu_fuser;
    cs3d_host_2d      cond_tokens;
    hipDeviceptr_t       d_cond_tokens;     /* device mirror, [n_tok × D_out] f32 */

    /* Phase 2b.8d GPU PPE — lazy-init on first run_cond_fuser call. */
    cs3d_ppe_gpu      gpu_ppe;
    int               gpu_ppe_loaded;
    cs3d_ppe_fns      gpu_ppe_fns;
    cs3d_ppe_ws       gpu_ppe_ws;
    int               gpu_ppe_ws_alloced;

    /* Phase 2b.8e GPU fuser projection. */
    cs3d_fuser_gpu    gpu_fuser;
    int               gpu_fuser_loaded;
    cs3d_fuser_fns    gpu_fuser_fns;
    cs3d_fuser_ws     gpu_fuser_ws;
    int               gpu_fuser_ws_alloced;

    sam3d_cpu_ss_dit *cpu_ss_dit;
    cs3d_host_nd      ss_latent;         /* [8,16,16,16] f32 NCDHW */
    hipDeviceptr_t       d_ss_latent;       /* device mirror */

    /* Phase 2c.13 GPU SS Flow DiT — lazy-init on first ss_dit call. */
    cs3d_ssdit_gpu        gpu_ssdit;
    int                   gpu_ssdit_loaded;
    cs3d_ssdit_outer_fns  gpu_ssdit_fns;
    cs3d_ssdit_block_ws   gpu_ssdit_block_ws;
    cs3d_ssdit_outer_ws   gpu_ssdit_outer_ws;
    int                   gpu_ssdit_ws_alloced;
    int                   gpu_ssdit_ws_n_c;

    sam3d_cpu_ss_dec *cpu_ss_dec;
    cs3d_host_nd      occupancy;         /* [64,64,64] f32 logits */
    hipDeviceptr_t       d_occupancy;       /* device mirror */

    /* Phase 4b GPU SS-VAE decoder. */
    cs3d_ssdec_gpu    gpu_ssdec;
    int               gpu_ssdec_loaded;
    cs3d_ssdec_fns    gpu_ssdec_fns;
    cs3d_ssdec_ws     gpu_ssdec_ws;
    int               gpu_ssdec_ws_alloced;

    sam3d_cpu_slat_dit *cpu_slat_dit;
    cs3d_host_slat      slat_tokens;     /* (coords[N,4], feats[N,out_ch]) f32 */
    hipDeviceptr_t         d_slat_feats;    /* device mirror */
    hipDeviceptr_t         d_slat_coords;   /* device mirror */
    cs3d_slatdit_gpu       gpu_slatdit;
    int                    gpu_slatdit_loaded;
    cs3d_slatdit_fns       gpu_slatdit_fns;
    cs3d_slatdit_block_ws  gpu_slatdit_ws;
    int                    gpu_slatdit_ws_alloced;
    int                    gpu_slatdit_ws_n;
    int                    gpu_slatdit_ws_nc;
    hipDeviceptr_t            d_slat_hook_x;
    hipDeviceptr_t            d_slat_hook_coords;
    hipDeviceptr_t            d_slat_hook_t_emb;
    size_t                 slat_hook_x_bytes;
    size_t                 slat_hook_coords_bytes;
    size_t                 slat_hook_t_emb_bytes;
    int32_t               *slat_hook_coords_cache;
    size_t                 slat_hook_coords_cache_bytes;
    cs3d_slat_io_gpu       gpu_slat_io;
    cs3d_slat_io_fns       gpu_slat_io_fns;
    cs3d_slat_io_ws        gpu_slat_io_ws;

