lighttransport/gemm/rdna4/sam3d/hip_sam3d_runner.c
    sam3d_cpu_gs_decoder *cpu_gs;
    cs3d_host_2d          gaussians;      /* [N*G, 17] PLY-layout f32 */
    hipDeviceptr_t           d_gaussians;    /* device mirror */
    cs3d_gs_head_gpu      gpu_gs_head;
    cs3d_gs_head_ws       gpu_gs_head_ws;
};

/* ===== tiny helpers ===== */

static char *cs3d_strdup(const char *s) {
    if (!s) return NULL;
    size_t n = strlen(s) + 1;
    char *r = (char *)malloc(n);
    if (r) memcpy(r, s, n);
    return r;
}

/* If cfg->safetensors_dir is non-NULL, return a strdup. Otherwise derive
 * from pipeline_yaml's parent directory by appending /../safetensors. */
static char *cs3d_resolve_safetensors_dir(const hip_sam3d_config *cfg) {
    if (cfg->safetensors_dir && cfg->safetensors_dir[0])
        return cs3d_strdup(cfg->safetensors_dir);
    if (!cfg->pipeline_yaml || !cfg->pipeline_yaml[0]) return NULL;
    /* dirname(pipeline_yaml) + "/../safetensors" */
    const char *p = cfg->pipeline_yaml;
    const char *slash = strrchr(p, '/');
    size_t dir_len = slash ? (size_t)(slash - p) : 0;
    const char *suffix = "/../safetensors";
    size_t suf_len = strlen(suffix);
    char *r = (char *)malloc(dir_len + suf_len + 1);
    if (!r) return NULL;
    if (dir_len) memcpy(r, p, dir_len);
    memcpy(r + dir_len, suffix, suf_len + 1);
    return r;
}

static void cs3d_free_2d(cs3d_host_2d *t)   { free(t->data); t->data = NULL; t->n = t->c = 0; }
static void cs3d_free_nd(cs3d_host_nd *t)   { free(t->data); t->data = NULL; t->ndim = 0; }
static void cs3d_free_slat(cs3d_host_slat *t) {
    free(t->feats); free(t->coords);
    t->feats = NULL; t->coords = NULL; t->n = t->c = 0;
}

static void cs3d_slat_io_block_gpu_free(cs3d_slat_io_block_gpu *b)
{
    if (!b) return;
    if (b->norm1_w) hipFree(b->norm1_w);
    if (b->norm1_b) hipFree(b->norm1_b);
    if (b->conv1_w) hipFree(b->conv1_w);
    if (b->conv1_b) hipFree(b->conv1_b);
    if (b->conv2_w) hipFree(b->conv2_w);
    if (b->conv2_b) hipFree(b->conv2_b);
    if (b->emb_w)   hipFree(b->emb_w);
    if (b->emb_b)   hipFree(b->emb_b);
    if (b->skip_w)  hipFree(b->skip_w);
    if (b->skip_b)  hipFree(b->skip_b);
    memset(b, 0, sizeof(*b));
}

static void cs3d_slat_io_gpu_free(cs3d_slat_io_gpu *g)
{
    if (!g) return;
    for (int i = 0; i < 2; i++) {
        cs3d_slat_io_block_gpu_free(&g->input[i]);
        cs3d_slat_io_block_gpu_free(&g->output[i]);
    }
    if (g->input_w) hipFree(g->input_w);
    if (g->input_b) hipFree(g->input_b);
    if (g->out_w) hipFree(g->out_w);
    if (g->out_b) hipFree(g->out_b);
    memset(g, 0, sizeof(*g));
}

static void cs3d_slat_io_ws_free(cs3d_slat_io_ws *w)
{
    if (!w) return;
    if (w->d_in_coords) hipFree(w->d_in_coords);
    if (w->d_in_feats)  hipFree(w->d_in_feats);
    if (w->d_coords)    hipFree(w->d_coords);
    if (w->d_base)      hipFree(w->d_base);
    if (w->d_counts)    hipFree(w->d_counts);
    if (w->d_outN)      hipFree(w->d_outN);
    if (w->d_index)     hipFree(w->d_index);
    if (w->d_t)         hipFree(w->d_t);
    if (w->d_t_silu)    hipFree(w->d_t_silu);
    if (w->d_emb)       hipFree(w->d_emb);
    if (w->d_skip)      hipFree(w->d_skip);
    if (w->d_h1)        hipFree(w->d_h1);
    if (w->d_h2)        hipFree(w->d_h2);
    if (w->d_h3)        hipFree(w->d_h3);
    if (w->d_h4)        hipFree(w->d_h4);
    memset(w, 0, sizeof(*w));
}

static void cs3d_gs_head_gpu_free(cs3d_gs_head_gpu *g)
{
    if (!g) return;
    if (g->input_w) hipFree(g->input_w);
    if (g->input_b) hipFree(g->input_b);
    if (g->out_w) hipFree(g->out_w);
    if (g->out_b) hipFree(g->out_b);
    if (g->mlp_blocks) {
        for (int i = 0; i < g->n_mlp_blocks; i++) {
            if (g->mlp_blocks[i].qkv_w) hipFree(g->mlp_blocks[i].qkv_w);
            if (g->mlp_blocks[i].qkv_b) hipFree(g->mlp_blocks[i].qkv_b);
            if (g->mlp_blocks[i].out_w) hipFree(g->mlp_blocks[i].out_w);
            if (g->mlp_blocks[i].out_b) hipFree(g->mlp_blocks[i].out_b);
            if (g->mlp_blocks[i].fc1_w) hipFree(g->mlp_blocks[i].fc1_w);
            if (g->mlp_blocks[i].fc1_b) hipFree(g->mlp_blocks[i].fc1_b);
            if (g->mlp_blocks[i].fc2_w) hipFree(g->mlp_blocks[i].fc2_w);
            if (g->mlp_blocks[i].fc2_b) hipFree(g->mlp_blocks[i].fc2_b);
        }
        free(g->mlp_blocks);
    }
    memset(g, 0, sizeof(*g));
}

static void cs3d_gs_head_ws_free(cs3d_gs_head_ws *w)
{
    if (!w) return;
    if (w->d_coords) hipFree(w->d_coords);
    if (w->d_in)     hipFree(w->d_in);
    if (w->d_h)      hipFree(w->d_h);
    if (w->d_ln)     hipFree(w->d_ln);
    if (w->d_out)    hipFree(w->d_out);
    if (w->d_qkv)    hipFree(w->d_qkv);
    if (w->d_fwd)    hipFree(w->d_fwd);
    if (w->d_attn)   hipFree(w->d_attn);
    if (w->d_q)      hipFree(w->d_q);
    if (w->d_k)      hipFree(w->d_k);
    if (w->d_v)      hipFree(w->d_v);
    if (w->d_win)    hipFree(w->d_win);
    if (w->d_mlp)    hipFree(w->d_mlp);
    memset(w, 0, sizeof(*w));
}

/* ===== public API ===== */

hip_sam3d_ctx *hip_sam3d_create(const hip_sam3d_config *cfg)
{
    if (!cfg) return NULL;

    hip_sam3d_ctx *c = (hip_sam3d_ctx *)calloc(1, sizeof(*c));
    if (!c) return NULL;
    c->cfg = *cfg;
    c->device_id = cfg->device_ordinal;
    if (c->cfg.ss_steps   <= 0) c->cfg.ss_steps   = 2;
    if (c->cfg.slat_steps <= 0) c->cfg.slat_steps = 12;
    if (c->cfg.cfg_scale  <= 0) c->cfg.cfg_scale  = 2.0f;

    c->safetensors_dir_resolved = cs3d_resolve_safetensors_dir(cfg);
    if (!c->safetensors_dir_resolved) {
        fprintf(stderr, "hip_sam3d: need safetensors_dir or pipeline_yaml\n");
        free(c); return NULL;
    }

    if (rocewInit(ROCEW_INIT_HIP | ROCEW_INIT_HIPRTC) != ROCEW_SUCCESS) {
        fprintf(stderr, "hip_sam3d: rocew init failed (no HIP/ROCm runtime?)\n");
        free(c->safetensors_dir_resolved); free(c);
        return NULL;
    }
    if (hipInit(0) != hipSuccess) {
        fprintf(stderr, "hip_sam3d: hipInit failed\n");
        free(c->safetensors_dir_resolved); free(c);
        return NULL;
    }
    hipDevice_t dev;
    if ((dev = (c->device_id), hipSetDevice(c->device_id)) != hipSuccess) {
        fprintf(stderr, "hip_sam3d: hipSetDevice(%d) failed\n", c->device_id);
        free(c->safetensors_dir_resolved); free(c);
        return NULL;
    }
    hipCtx_t cu_ctx;
    if (hipCtxCreate(&cu_ctx, 0, dev) != hipSuccess) {
        fprintf(stderr, "hip_sam3d: hipCtxCreate failed\n");
        free(c->safetensors_dir_resolved); free(c);
        return NULL;
    }

