lighttransport/gemm/rdna4/sam3d/hip_sam3d_runner.c
    c->sm = hip_compile_kernels(&c->mod, c->device_id, hip_sam3d_kernel_src,
                               "sam3d_kernels.cu", c->cfg.verbose,
                               "hip_sam3d");
    if (c->sm < 0) {
        free(c->safetensors_dir_resolved); free(c);
        return NULL;
    }
    if (hipModuleGetFunction(&c->fn_sentinel, c->mod, "sam3d_sentinel") != hipSuccess) {
        fprintf(stderr, "hip_sam3d: missing sam3d_sentinel\n");
        free(c->safetensors_dir_resolved); free(c);
        return NULL;
    }
    c->compiled = 1;

    if (c->cfg.verbose >= 1) {
        fprintf(stderr, "hip_sam3d: created (sm_%d, safetensors_dir=%s)\n",
                c->sm, c->safetensors_dir_resolved);
    }
    return c;
}

void hip_sam3d_destroy(hip_sam3d_ctx *ctx)
{
    if (!ctx) return;
    free(ctx->img_rgba); free(ctx->mask_u8); free(ctx->pmap_f32);
    cs3d_free_2d(&ctx->ovr_dinov2);
    cs3d_free_2d(&ctx->ovr_cond);
    cs3d_free_nd(&ctx->ovr_ss_latent);
    cs3d_free_nd(&ctx->ovr_occupancy);
    cs3d_free_slat(&ctx->ovr_slat);
    cs3d_free_2d(&ctx->dinov2_tokens);
    if (ctx->d_dinov2_tokens) hipFree(ctx->d_dinov2_tokens);
    if (ctx->cpu_dinov2) sam3d_cpu_dinov2_free(ctx->cpu_dinov2);
    if (ctx->gpu_dinov2_ws_alloced) cs3d_dinov2_block_ws_free(&ctx->gpu_dinov2_ws);
    if (ctx->gpu_dinov2_loaded) cs3d_dinov2_gpu_free(&ctx->gpu_dinov2);
    cs3d_free_2d(&ctx->cond_tokens);
    if (ctx->d_cond_tokens) hipFree(ctx->d_cond_tokens);
    if (ctx->gpu_ppe_ws_alloced)   cs3d_ppe_ws_free(&ctx->gpu_ppe_ws);
    if (ctx->gpu_ppe_loaded)       cs3d_ppe_gpu_free(&ctx->gpu_ppe);
    if (ctx->gpu_fuser_ws_alloced) cs3d_fuser_ws_free(&ctx->gpu_fuser_ws);
    if (ctx->gpu_fuser_loaded)     cs3d_fuser_gpu_free(&ctx->gpu_fuser);
    if (ctx->cpu_fuser) sam3d_cpu_fuser_free(ctx->cpu_fuser);
    cs3d_free_nd(&ctx->ss_latent);
    if (ctx->d_ss_latent) hipFree(ctx->d_ss_latent);
    if (ctx->gpu_ssdit_ws_alloced) {
        cs3d_ssdit_outer_ws_free(&ctx->gpu_ssdit_outer_ws);
        cs3d_ssdit_block_ws_free(&ctx->gpu_ssdit_block_ws);
    }
    if (ctx->gpu_ssdit_loaded) cs3d_ssdit_gpu_free(&ctx->gpu_ssdit);
    if (ctx->cpu_ss_dit) sam3d_cpu_ss_dit_free(ctx->cpu_ss_dit);
    cs3d_free_nd(&ctx->occupancy);
    if (ctx->d_occupancy) hipFree(ctx->d_occupancy);
    if (ctx->gpu_ssdec_ws_alloced) cs3d_ssdec_ws_free(&ctx->gpu_ssdec_ws);
    if (ctx->gpu_ssdec_loaded)     cs3d_ssdec_gpu_free(&ctx->gpu_ssdec);
    if (ctx->cpu_ss_dec) sam3d_cpu_ss_dec_free(ctx->cpu_ss_dec);
    cs3d_free_slat(&ctx->slat_tokens);
    if (ctx->d_slat_feats)  hipFree(ctx->d_slat_feats);
    if (ctx->d_slat_coords) hipFree(ctx->d_slat_coords);
    if (ctx->d_slat_hook_x)     hipFree(ctx->d_slat_hook_x);
    if (ctx->d_slat_hook_coords) hipFree(ctx->d_slat_hook_coords);
    if (ctx->d_slat_hook_t_emb) hipFree(ctx->d_slat_hook_t_emb);
    free(ctx->slat_hook_coords_cache);
    if (ctx->gpu_slatdit_ws_alloced) cs3d_slatdit_block_ws_free(&ctx->gpu_slatdit_ws);
    if (ctx->gpu_slatdit_loaded)     cs3d_slatdit_gpu_free(&ctx->gpu_slatdit);
    if (ctx->gpu_slat_io.loaded)     cs3d_slat_io_gpu_free(&ctx->gpu_slat_io);
    cs3d_slat_io_ws_free(&ctx->gpu_slat_io_ws);
    if (ctx->cpu_slat_dit) sam3d_cpu_slat_dit_free(ctx->cpu_slat_dit);
    cs3d_free_2d(&ctx->gaussians);
    if (ctx->d_gaussians) hipFree(ctx->d_gaussians);
    if (ctx->gpu_gs_head.loaded) cs3d_gs_head_gpu_free(&ctx->gpu_gs_head);
    cs3d_gs_head_ws_free(&ctx->gpu_gs_head_ws);
    if (ctx->cpu_gs) sam3d_cpu_gs_decoder_free(ctx->cpu_gs);
    if (ctx->compiled) hipModuleUnload(ctx->mod);
    free(ctx->safetensors_dir_resolved);
    free(ctx);
}

/* ===== inputs ===== */

int hip_sam3d_set_image_rgba(hip_sam3d_ctx *ctx, const uint8_t *rgba,
                              int width, int height) {
    if (!ctx || !rgba || width <= 0 || height <= 0) return HIP_SAM3D_E_INVAL;
    free(ctx->img_rgba);
    size_t n = (size_t)width * height * 4;
    ctx->img_rgba = (uint8_t *)malloc(n);
    if (!ctx->img_rgba) return HIP_SAM3D_E_LOAD;
    memcpy(ctx->img_rgba, rgba, n);
    ctx->img_w = width; ctx->img_h = height;
    return HIP_SAM3D_E_OK;
}

int hip_sam3d_set_mask(hip_sam3d_ctx *ctx, const uint8_t *mask,
                        int width, int height) {
    if (!ctx || !mask || width <= 0 || height <= 0) return HIP_SAM3D_E_INVAL;
    free(ctx->mask_u8);
    size_t n = (size_t)width * height;
    ctx->mask_u8 = (uint8_t *)malloc(n);
    if (!ctx->mask_u8) return HIP_SAM3D_E_LOAD;
    memcpy(ctx->mask_u8, mask, n);
    ctx->msk_w = width; ctx->msk_h = height;
    return HIP_SAM3D_E_OK;
}

int hip_sam3d_set_pointmap(hip_sam3d_ctx *ctx, const float *pmap,
                            int width, int height) {
    if (!ctx || !pmap || width <= 0 || height <= 0) return HIP_SAM3D_E_INVAL;
    free(ctx->pmap_f32);
    size_t n = (size_t)width * height * 3;
    ctx->pmap_f32 = (float *)malloc(n * sizeof(float));
    if (!ctx->pmap_f32) return HIP_SAM3D_E_LOAD;
    memcpy(ctx->pmap_f32, pmap, n * sizeof(float));
    ctx->pmap_w = width; ctx->pmap_h = height;
    return HIP_SAM3D_E_OK;
}

/* ===== stage stubs ===== */

/* Adopt a freshly-computed [n × c] f32 token block as the dinov2
 * stage output. Frees any prior host/device buffers. Takes ownership
 * of `feats` (must be malloc'd). */
static int cs3d_adopt_dinov2_tokens(hip_sam3d_ctx *ctx, float *feats,
                                    int n, int c)
{
    cs3d_free_2d(&ctx->dinov2_tokens);
    if (ctx->d_dinov2_tokens) {
        hipFree(ctx->d_dinov2_tokens);
        ctx->d_dinov2_tokens = 0;
    }
    if (!feats || n <= 0 || c <= 0) return HIP_SAM3D_E_INVAL;

    size_t bytes = (size_t)n * c * sizeof(float);
    ctx->d_dinov2_tokens = hip_upload_raw(feats, bytes);
    if (!ctx->d_dinov2_tokens) { free(feats); return HIP_SAM3D_E_LOAD; }
    ctx->dinov2_tokens.data = feats;
    ctx->dinov2_tokens.n    = n;
    ctx->dinov2_tokens.c    = c;
    return HIP_SAM3D_E_OK;
}

/* Phase 1b.8: run one branch (image or mask) through the GPU forward.
 * chw_norm is [3, S, S] f32, normalized. Returns malloc'd [n_tok × dim]
 * with the n_register tokens removed (matching CPU numerics). */
static float *cs3d_gpu_dinov2_encode_branch(hip_sam3d_ctx *ctx,
                                            const float *chw_norm)
{
    cs3d_dinov2_gpu *g = &ctx->gpu_dinov2;
    size_t n_img = (size_t)3 * g->image_size * g->image_size;
    size_t n_out = (size_t)g->n_tokens * g->dim;

    hipDeviceptr_t d_img = hip_upload_raw(chw_norm, n_img * sizeof(float));
    if (!d_img) return NULL;
    hipDeviceptr_t d_out = 0;
    if (hipMalloc(&d_out, n_out * sizeof(float)) != hipSuccess) {
        hipFree(d_img); return NULL;
    }
    int rc = cs3d_dinov2_gpu_forward(&ctx->gpu_dinov2_fns, &ctx->gpu_dinov2_ws,
                                     g, d_img, d_out);
    hipFree(d_img);
    if (rc < 0) { hipFree(d_out); return NULL; }

    float *host = (float *)malloc(n_out * sizeof(float));
    if (!host) { hipFree(d_out); return NULL; }
    if (hipMemcpyDtoH(host, d_out, n_out * sizeof(float)) != hipSuccess) {
        free(host); hipFree(d_out); return NULL;
    }
    hipFree(d_out);

    /* Drop register tokens in-place: keep [CLS] then patch tokens, skip
     * the n_register tokens between them. */
    int dim       = g->dim;
    int n_reg     = g->n_register;
    int keep_pat  = g->n_tokens - 1 - n_reg;
    if (n_reg > 0 && keep_pat > 0) {
        memmove(host + (size_t)dim,
                host + (size_t)(1 + n_reg) * dim,
                (size_t)keep_pat * dim * sizeof(float));
    }
    return host;
}

int hip_sam3d_run_dinov2(hip_sam3d_ctx *ctx) {
    if (!ctx) return HIP_SAM3D_E_INVAL;
    if (!ctx->img_rgba) return HIP_SAM3D_E_NO_INPUT;

    /* CPU model kept for preprocessing (image_mean/std + bilinear-resize
     * + ImageNet-normalize); the encode itself runs on the GPU. */
    if (!ctx->cpu_dinov2) {
        char path[1200];
        snprintf(path, sizeof(path), "%s/sam3d_dinov2.safetensors",
                 ctx->safetensors_dir_resolved);
        ctx->cpu_dinov2 = sam3d_cpu_dinov2_load(path);
        if (!ctx->cpu_dinov2) {
            fprintf(stderr, "hip_sam3d: dinov2 load failed (%s)\n", path);
            return HIP_SAM3D_E_LOAD;
        }
    }
    if (!ctx->gpu_dinov2_loaded) {
        char path[1200];
        snprintf(path, sizeof(path), "%s/sam3d_dinov2.safetensors",
                 ctx->safetensors_dir_resolved);
        if (cs3d_dinov2_gpu_load(&ctx->gpu_dinov2, path, ctx->cfg.verbose) < 0) {
            fprintf(stderr, "hip_sam3d: gpu dinov2 weight upload failed\n");
            return HIP_SAM3D_E_LOAD;
        }
        ctx->gpu_dinov2_loaded = 1;
        if (cs3d_dinov2_fns_lookup(&ctx->gpu_dinov2_fns, ctx->mod) < 0) {
            fprintf(stderr, "hip_sam3d: gpu dinov2 fns lookup failed\n");
            return HIP_SAM3D_E_LOAD;
        }
        if (cs3d_dinov2_block_ws_alloc(&ctx->gpu_dinov2_ws,
                                       ctx->gpu_dinov2.n_tokens,
                                       ctx->gpu_dinov2.dim,
                                       ctx->gpu_dinov2.ffn_hidden) < 0) {
            fprintf(stderr, "hip_sam3d: gpu dinov2 ws alloc failed\n");
            return HIP_SAM3D_E_LOAD;
        }
        ctx->gpu_dinov2_ws_alloced = 1;
    }

