lighttransport/gemm/rdna4/sam3d/hip_sam3d_runner.c
    int dim   = ctx->gpu_dinov2.dim;
    int n_reg = ctx->gpu_dinov2.n_register;
    int n_per = ctx->gpu_dinov2.n_tokens - n_reg;  /* CLS + patches */

    float *chw_img = sam3d_cpu_dinov2_preprocess_rgb(
        ctx->cpu_dinov2, ctx->img_rgba, ctx->img_w, ctx->img_h);
    if (!chw_img) return HIP_SAM3D_E_LOAD;
    float *feat_img = cs3d_gpu_dinov2_encode_branch(ctx, chw_img);
    free(chw_img);
    if (!feat_img) {
        fprintf(stderr, "hip_sam3d: gpu dinov2 image branch failed\n");
        return HIP_SAM3D_E_LOAD;
    }

    float *feat_msk = NULL;
    if (ctx->mask_u8) {
        float *chw_msk = sam3d_cpu_dinov2_preprocess_mask(
            ctx->cpu_dinov2, ctx->mask_u8, ctx->msk_w, ctx->msk_h);
        if (!chw_msk) { free(feat_img); return HIP_SAM3D_E_LOAD; }
        feat_msk = cs3d_gpu_dinov2_encode_branch(ctx, chw_msk);
        free(chw_msk);
        if (!feat_msk) {
            fprintf(stderr, "hip_sam3d: gpu dinov2 mask branch failed\n");
            free(feat_img);
            return HIP_SAM3D_E_LOAD;
        }
    }

    int n_branches = feat_msk ? 2 : 1;
    int n_total    = n_branches * n_per;
    float *feats   = (float *)malloc((size_t)n_total * dim * sizeof(float));
    if (!feats) { free(feat_img); free(feat_msk); return HIP_SAM3D_E_LOAD; }
    memcpy(feats, feat_img, (size_t)n_per * dim * sizeof(float));
    if (feat_msk) {
        memcpy(feats + (size_t)n_per * dim, feat_msk,
               (size_t)n_per * dim * sizeof(float));
    }
    free(feat_img); free(feat_msk);
    return cs3d_adopt_dinov2_tokens(ctx, feats, n_total, dim);
}
/* Active dinov2 source: prefer override (verify_*.c injects ref data
 * via hip_sam3d_debug_override_dinov2) so a single verify can isolate
 * cond_fuser drift from upstream dinov2 drift. */
static const cs3d_host_2d *cs3d_active_dinov2(const hip_sam3d_ctx *ctx)
{
    return ctx->ovr_dinov2.data ? &ctx->ovr_dinov2 : &ctx->dinov2_tokens;
}

static int cs3d_adopt_cond_tokens(hip_sam3d_ctx *ctx, float *feats,
                                  int n, int c)
{
    cs3d_free_2d(&ctx->cond_tokens);
    if (ctx->d_cond_tokens) {
        hipFree(ctx->d_cond_tokens);
        ctx->d_cond_tokens = 0;
    }
    if (!feats || n <= 0 || c <= 0) return HIP_SAM3D_E_INVAL;
    size_t bytes = (size_t)n * c * sizeof(float);
    ctx->d_cond_tokens = hip_upload_raw(feats, bytes);
    if (!ctx->d_cond_tokens) { free(feats); return HIP_SAM3D_E_LOAD; }
    ctx->cond_tokens.data = feats;
    ctx->cond_tokens.n    = n;
    ctx->cond_tokens.c    = c;
    return HIP_SAM3D_E_OK;
}

int hip_sam3d_run_cond_fuser(hip_sam3d_ctx *ctx) {
    if (!ctx) return HIP_SAM3D_E_INVAL;
    const cs3d_host_2d *dino = cs3d_active_dinov2(ctx);
    if (!dino->data) {
        fprintf(stderr, "hip_sam3d: cond_fuser needs dinov2 tokens — "
                        "run dinov2 (or override) first\n");
        return HIP_SAM3D_E_NO_INPUT;
    }

    if (!ctx->cpu_fuser) {
        ctx->cpu_fuser = sam3d_cpu_fuser_load(ctx->safetensors_dir_resolved);
        if (!ctx->cpu_fuser) {
            fprintf(stderr, "hip_sam3d: fuser/PPE load failed\n");
            return HIP_SAM3D_E_LOAD;
        }
    }

#if defined(_OPENMP)
    int nthr = omp_get_max_threads();
    if (nthr < 1) nthr = 1;
#else
    int nthr = 1;
#endif

    sam3d_ppe_model   *ppe_m = sam3d_cpu_fuser_ppe_model  (ctx->cpu_fuser);
    sam3d_fuser_model *fus_m = sam3d_cpu_fuser_fuser_model(ctx->cpu_fuser);
    int branch  = dino->n / 2;
    int Di_dino = dino->c;
    int have_ppe = (ctx->pmap_f32 && ppe_m && ctx->pmap_h > 0 && ctx->pmap_w > 0
                    && fus_m && fus_m->n_modalities >= 3);
    int S      = have_ppe ? ppe_m->input_size : 0;
    int Np     = have_ppe ? ppe_m->num_patches : 0;
    int Nwin   = have_ppe ? Np * Np : 0;
    int D_ppe  = have_ppe ? ppe_m->embed_dim : 0;
    int n_total = branch * 2 + Nwin;
    int Do = sam3d_cpu_fuser_dim_out(ctx->cpu_fuser);

    if (branch <= 0 || branch * 2 != dino->n || Do <= 0) {
        fprintf(stderr, "hip_sam3d: cond_fuser bad shape (branch=%d dim=%d Do=%d)\n",
                branch, Di_dino, Do);
        return HIP_SAM3D_E_INVAL;
    }

    /* Lazy-load PPE GPU. */
    if (have_ppe && !ctx->gpu_ppe_loaded) {
        if (cs3d_ppe_gpu_load(&ctx->gpu_ppe, ppe_m, ctx->cfg.verbose) < 0)
            return HIP_SAM3D_E_LOAD;
        ctx->gpu_ppe_loaded = 1;
        if (cs3d_ppe_fns_lookup(&ctx->gpu_ppe_fns, ctx->mod) < 0)
            return HIP_SAM3D_E_LOAD;
        if (cs3d_ppe_ws_alloc(&ctx->gpu_ppe_ws,
                              ctx->gpu_ppe.Np, ctx->gpu_ppe.P,
                              ctx->gpu_ppe.D,  ctx->gpu_ppe.ffn) < 0)
            return HIP_SAM3D_E_LOAD;
        ctx->gpu_ppe_ws_alloced = 1;
    }

    /* Lazy-load fuser GPU + workspace. */
    if (!ctx->gpu_fuser_loaded) {
        if (cs3d_fuser_gpu_load(&ctx->gpu_fuser, fus_m, ctx->cfg.verbose) < 0)
            return HIP_SAM3D_E_LOAD;
        ctx->gpu_fuser_loaded = 1;
        if (cs3d_fuser_fns_lookup(&ctx->gpu_fuser_fns, ctx->mod) < 0)
            return HIP_SAM3D_E_LOAD;
        int N_max = branch > Nwin ? branch : Nwin;
        int Di_max = 0, Dh_max = 0;
        for (int i = 0; i < ctx->gpu_fuser.n_modalities; i++) {
            if (ctx->gpu_fuser.projs[i].Di > Di_max) Di_max = ctx->gpu_fuser.projs[i].Di;
            if (ctx->gpu_fuser.projs[i].Dh > Dh_max) Dh_max = ctx->gpu_fuser.projs[i].Dh;
        }
        if (cs3d_fuser_ws_alloc(&ctx->gpu_fuser_ws, N_max, Di_max, Dh_max) < 0)
            return HIP_SAM3D_E_LOAD;
        ctx->gpu_fuser_ws_alloced = 1;
    }

    /* Run PPE on-device into d_ppe[Nwin, D_ppe]. */
    hipDeviceptr_t d_ppe = 0;
    if (have_ppe) {
        float *pmap_S = (float *)malloc((size_t)S * S * 3 * sizeof(float));
        if (!pmap_S) return HIP_SAM3D_E_LOAD;
        int IH = ctx->pmap_h, IW = ctx->pmap_w;
        for (int oy = 0; oy < S; oy++) {
            int iy = (int)((float)oy * IH / S); if (iy >= IH) iy = IH - 1;
            for (int ox = 0; ox < S; ox++) {
                int ix = (int)((float)ox * IW / S); if (ix >= IW) ix = IW - 1;
                const float *src = ctx->pmap_f32 + ((size_t)iy * IW + ix) * 3;
                float *dst = pmap_S + ((size_t)oy * S + ox) * 3;
                dst[0] = src[0]; dst[1] = src[1]; dst[2] = src[2];
            }
        }
        hipDeviceptr_t d_pmap = hip_upload_raw(pmap_S, (size_t)S * S * 3 * sizeof(float));
        free(pmap_S);
        if (!d_pmap ||
            hipMalloc(&d_ppe, (size_t)Nwin * D_ppe * sizeof(float)) != hipSuccess) {
            if (d_pmap) hipFree(d_pmap);
            return HIP_SAM3D_E_LOAD;
        }
        if (cs3d_ppe_forward(&ctx->gpu_ppe_fns, &ctx->gpu_ppe_ws,
                             &ctx->gpu_ppe.w, d_pmap, d_ppe,
                             ctx->gpu_ppe.n_heads, ctx->gpu_ppe.ln_eps) < 0) {
            hipFree(d_pmap); hipFree(d_ppe);
            return HIP_SAM3D_E_LOAD;
        }
        hipFree(d_pmap);
    }

    /* Upload dino tokens, allocate output cond buffer. */
    hipDeviceptr_t d_dino = hip_upload_raw(dino->data,
                                       (size_t)dino->n * Di_dino * sizeof(float));
    hipDeviceptr_t d_cond = 0;
    if (!d_dino ||
        hipMalloc(&d_cond, (size_t)n_total * Do * sizeof(float)) != hipSuccess) {
        if (d_dino) hipFree(d_dino);
        if (d_ppe)  hipFree(d_ppe);
        return HIP_SAM3D_E_LOAD;
    }

