lighttransport/gemm/rdna4/sam3d/hip_sam3d_runner.c
static int cs3d_ensure_slatdit_gpu(hip_sam3d_ctx *ctx, int n_max, int n_cond)
{
    int rc = cs3d_ensure_slat_dit(ctx);
    if (rc != HIP_SAM3D_E_OK) return rc;
    sam3d_slat_dit_model *m = sam3d_cpu_slat_dit_model(ctx->cpu_slat_dit);
    if (!m) return HIP_SAM3D_E_LOAD;

    if (!ctx->gpu_slatdit_loaded) {
        if (cs3d_slatdit_gpu_load_transformer(&ctx->gpu_slatdit, m, ctx->cfg.verbose) != 0) {
            fprintf(stderr, "hip_sam3d: gpu slat_dit transformer weight upload failed\n");
            return HIP_SAM3D_E_LOAD;
        }
        ctx->gpu_slatdit_loaded = 1;
        if (cs3d_slatdit_fns_lookup(&ctx->gpu_slatdit_fns, ctx->mod) != 0) {
            fprintf(stderr, "hip_sam3d: gpu slat_dit fns lookup failed\n");
            return HIP_SAM3D_E_LOAD;
        }
    }

    if (ctx->gpu_slatdit_ws_alloced &&
        (n_max > ctx->gpu_slatdit_ws_n || n_cond > ctx->gpu_slatdit_ws_nc)) {
        cs3d_slatdit_block_ws_free(&ctx->gpu_slatdit_ws);
        ctx->gpu_slatdit_ws_alloced = 0;
    }
    if (!ctx->gpu_slatdit_ws_alloced) {
        if (cs3d_slatdit_block_ws_alloc(&ctx->gpu_slatdit_ws, n_max, n_cond,
                                        ctx->gpu_slatdit.dim,
                                        ctx->gpu_slatdit.mlp_hidden) != 0) {
            fprintf(stderr, "hip_sam3d: gpu slat_dit transformer ws alloc failed\n");
            return HIP_SAM3D_E_LOAD;
        }
        ctx->gpu_slatdit_ws_alloced = 1;
        ctx->gpu_slatdit_ws_n = n_max;
        ctx->gpu_slatdit_ws_nc = n_cond;
    }
    return HIP_SAM3D_E_OK;
}

static int cs3d_ensure_devbuf(hipDeviceptr_t *ptr, size_t *cap, size_t need)
{
    if (!ptr || !cap || need == 0) return -1;
    if (*ptr && *cap >= need) return 0;
    if (*ptr) {
        hipFree(*ptr);
        *ptr = 0;
        *cap = 0;
    }
    if (hipMalloc(ptr, need) != hipSuccess) return -1;
    *cap = need;
    return 0;
}

static int cs3d_slat_io_upload_qtensor(const qtensor *t, const char *name,
                                       hipDeviceptr_t *out, size_t *total_bytes)
{
    if (!t || !t->data || t->n_rows <= 0 || t->n_cols <= 0 || !out)
        return -1;
    int n = t->n_rows * t->n_cols;
    float *buf = (float *)malloc((size_t)n * sizeof(float));
    if (!buf) return -1;
    if (t->type == GGML_TYPE_F32) {
        memcpy(buf, t->data, (size_t)n * sizeof(float));
    } else if (t->type == GGML_TYPE_F16) {
        const uint16_t *src = (const uint16_t *)t->data;
        for (int i = 0; i < n; i++) buf[i] = ggml_fp16_to_fp32(src[i]);
    } else {
        int bs = 0, ts = 0;
        switch (t->type) {
            case GGML_TYPE_Q8_0: bs = 32;  ts = 34;  break;
            case GGML_TYPE_Q4_K: bs = 256; ts = 144; break;
            case GGML_TYPE_Q6_K: bs = 256; ts = 210; break;
            default:
                free(buf);
                fprintf(stderr, "hip_sam3d: unsupported SLAT IO tensor %s\n", name);
                return -1;
        }
        size_t row_bytes = (size_t)((t->n_cols + bs - 1) / bs) * ts;
        for (int r = 0; r < t->n_rows; r++) {
            const void *row = (const uint8_t *)t->data + (size_t)r * row_bytes;
            dequant_row(t->type, row, buf + (size_t)r * t->n_cols, t->n_cols);
        }
    }
    size_t bytes = (size_t)n * sizeof(float);
    *out = hip_upload_raw(buf, bytes);
    free(buf);
    if (!*out) {
        fprintf(stderr, "hip_sam3d: SLAT IO upload failed for %s\n", name);
        return -1;
    }
    if (total_bytes) *total_bytes += bytes;
    return 0;
}

static int cs3d_slat_io_load_block(cs3d_slat_io_block_gpu *dst,
                                   const sam3d_slat_io_block *src,
                                   const char *name,
                                   size_t *total_bytes)
{
    if (!dst || !src) return -1;
    memset(dst, 0, sizeof(*dst));
    dst->C_in = src->C_in;
    dst->C_out = src->C_out;
    dst->updown = src->updown;
    dst->has_skip = src->has_skip;
#define UP_IO_(field) do { \
    char tname[128]; \
    snprintf(tname, sizeof(tname), "%s.%s", name, #field); \
    if (cs3d_slat_io_upload_qtensor(&src->field, tname, &dst->field, total_bytes) != 0) goto fail; \
} while (0)
    UP_IO_(norm1_w); UP_IO_(norm1_b);
    UP_IO_(conv1_w); UP_IO_(conv1_b);
    UP_IO_(conv2_w); UP_IO_(conv2_b);
    UP_IO_(emb_w);   UP_IO_(emb_b);
    if (src->has_skip) {
        UP_IO_(skip_w); UP_IO_(skip_b);
    }
#undef UP_IO_
    return 0;
fail:
    cs3d_slat_io_block_gpu_free(dst);
    return -1;
}

static int cs3d_slat_io_fns_lookup(cs3d_slat_io_fns *f, hipModule_t mod)
{
    if (!f) return -1;
    if (f->loaded) return 0;
    if (hipModuleGetFunction(&f->gemm, mod, "gemm_f32_bias") != hipSuccess ||
        hipModuleGetFunction(&f->down, mod, "slat_downsample2_mean_include_self_serial_f32") != hipSuccess ||
        hipModuleGetFunction(&f->up, mod, "slat_upsample2_nearest_f32") != hipSuccess ||
        hipModuleGetFunction(&f->idx, mod, "slat_build_coord_index64_i32") != hipSuccess ||
        hipModuleGetFunction(&f->ln, mod, "layernorm_token_f32") != hipSuccess ||
        hipModuleGetFunction(&f->silu, mod, "silu_inplace_f32") != hipSuccess ||
        hipModuleGetFunction(&f->conv, mod, "slat_submconv3x3_f32") != hipSuccess ||
        hipModuleGetFunction(&f->modln, mod, "modulated_ln_f32") != hipSuccess ||
        hipModuleGetFunction(&f->resadd, mod, "residual_add_f32") != hipSuccess)
        return -1;
    f->loaded = 1;
    return 0;
}

static int cs3d_ensure_slat_io_gpu(hip_sam3d_ctx *ctx)
{
    int rc = cs3d_ensure_slat_dit(ctx);
    if (rc != HIP_SAM3D_E_OK) return rc;
    sam3d_slat_dit_model *m = sam3d_cpu_slat_dit_model(ctx->cpu_slat_dit);
    if (!m || m->n_io_res_blocks != 2) return HIP_SAM3D_E_LOAD;
    if (cs3d_slat_io_fns_lookup(&ctx->gpu_slat_io_fns, ctx->mod) != 0) {
        fprintf(stderr, "hip_sam3d: gpu slat IO fns lookup failed\n");
        return HIP_SAM3D_E_LOAD;
    }
    if (ctx->gpu_slat_io.loaded) return HIP_SAM3D_E_OK;

    size_t total = 0;
    if (cs3d_slat_io_load_block(&ctx->gpu_slat_io.input[0], &m->input_blocks[0], "input_blocks.0", &total) != 0 ||
        cs3d_slat_io_load_block(&ctx->gpu_slat_io.input[1], &m->input_blocks[1], "input_blocks.1", &total) != 0 ||
        cs3d_slat_io_load_block(&ctx->gpu_slat_io.output[0], &m->out_blocks[0], "out_blocks.0", &total) != 0 ||
        cs3d_slat_io_load_block(&ctx->gpu_slat_io.output[1], &m->out_blocks[1], "out_blocks.1", &total) != 0 ||
        cs3d_slat_io_upload_qtensor(&m->input_w, "input_layer.weight", &ctx->gpu_slat_io.input_w, &total) != 0 ||
        cs3d_slat_io_upload_qtensor(&m->input_b, "input_layer.bias", &ctx->gpu_slat_io.input_b, &total) != 0 ||
        cs3d_slat_io_upload_qtensor(&m->out_w, "out_layer.weight", &ctx->gpu_slat_io.out_w, &total) != 0 ||
        cs3d_slat_io_upload_qtensor(&m->out_b, "out_layer.bias", &ctx->gpu_slat_io.out_b, &total) != 0) {
        cs3d_slat_io_gpu_free(&ctx->gpu_slat_io);
        fprintf(stderr, "hip_sam3d: gpu slat IO weight upload failed\n");
        return HIP_SAM3D_E_LOAD;
    }
    ctx->gpu_slat_io.input_in = m->input_w.n_cols;
    ctx->gpu_slat_io.input_out = m->input_w.n_rows;
    ctx->gpu_slat_io.out_in = m->out_w.n_cols;
    ctx->gpu_slat_io.out_out = m->out_w.n_rows;
    ctx->gpu_slat_io.total_bytes = total;
    ctx->gpu_slat_io.loaded = 1;
    if (ctx->cfg.verbose >= 1)
        fprintf(stderr, "hip_sam3d: SLAT IO GPU weights %.2f MiB\n",
                (double)total / (1024.0 * 1024.0));
    return HIP_SAM3D_E_OK;
}

/* Shared WMMA dispatch for SLAT/GS hook GEMM sites. `args` follows the
 * gemm_f32_bias layout {Y,X,W,bias,N,Din,Dout}. Routes to the BF16 WMMA
 * kernel when SAM3D_WMMA!=0 and dims are 16-aligned, else gemm_fallback.
 * Stream 0. The WMMA handle is resolved once and cached. */
static int cs3d_slat_gemm(hip_sam3d_ctx *ctx, hipFunction_t gemm_fallback,
                          void **args)
{
    static int wmma_enabled = -1;          /* -1 unresolved, 0 off, 1 on */
    static hipFunction_t wmma_fn = NULL;
    if (wmma_enabled < 0) {
        const char *e = getenv("SAM3D_WMMA");
        wmma_enabled = (!e || e[0] != '0') ? 1 : 0;
        if (wmma_enabled &&
            hipModuleGetFunction(&wmma_fn, ctx->mod,
                                 "gemm_bf16w_bf16a_wmma_t") != hipSuccess) {
            wmma_fn = NULL;
            wmma_enabled = 0;
        }
    }
    int N = *(int *)args[4], Din = *(int *)args[5], Dout = *(int *)args[6];
    if (wmma_enabled && wmma_fn && (Dout % 16 == 0) && (Din % 16 == 0)) {
        hipDeviceptr_t Y = *(hipDeviceptr_t *)args[0];
        hipDeviceptr_t X = *(hipDeviceptr_t *)args[1];
        hipDeviceptr_t W = *(hipDeviceptr_t *)args[2];
        hipDeviceptr_t B = *(hipDeviceptr_t *)args[3];
        void *wa[] = { &Y, &W, &X, &B, &Dout, &Din, &N };
        unsigned gx = (unsigned)((Dout + 127) / 128);
        unsigned gy = (unsigned)((N + 127) / 128);
        return hipModuleLaunchKernel(wmma_fn, gx, gy, 1, 256, 1, 1,
                                     0, 0, wa, NULL) == hipSuccess ? 0 : -1;
    }
    unsigned gx = (unsigned)((N + 15) / 16), gy = (unsigned)((Dout + 15) / 16);
    return hipModuleLaunchKernel(gemm_fallback, gx, gy, 1, 16, 16, 1,
                                 0, 0, args, NULL) == hipSuccess ? 0 : -1;
}

