lighttransport/gemm/rdna4/sam3d/hip_sam3d_runner.c
static int cs3d_slat_io_block_gpu_hook(void *user, int is_output,
                                       int block_idx, const void *bk_void,
                                       void *xp_void, const float *t_emb,
                                       const int32_t *up_target_coords,
                                       int up_target_N, int dim, float ln_eps)
{
    hip_sam3d_ctx *ctx = (hip_sam3d_ctx *)user;
    sp3d_tensor **xp = (sp3d_tensor **)xp_void;
    const sam3d_slat_io_block *bk = (const sam3d_slat_io_block *)bk_void;
    if (!ctx || !xp || !*xp || !bk || !t_emb || block_idx < 0 || block_idx >= 2)
        return -1;
    sp3d_tensor *x = *xp;
    if (x->N <= 0 || x->C != bk->C_in) return -1;
    if (cs3d_ensure_slat_io_gpu(ctx) != HIP_SAM3D_E_OK) return -1;
    cs3d_slat_io_block_gpu *gb = is_output ? &ctx->gpu_slat_io.output[block_idx]
                                           : &ctx->gpu_slat_io.input[block_idx];
    cs3d_slat_io_fns *fn = &ctx->gpu_slat_io_fns;
    int C_in = gb->C_in, C_out = gb->C_out;
    if (C_in != bk->C_in || C_out != bk->C_out) return -1;
    if (gb->updown == SAM3D_SLAT_UPDOWN_UP && (!up_target_coords || up_target_N <= 0))
        return -1;

    int inN = x->N;
    int outN = (gb->updown == SAM3D_SLAT_UPDOWN_UP) ? up_target_N : inN;
    cs3d_slat_io_ws *ws = &ctx->gpu_slat_io_ws;
    hipDeviceptr_t d_coords = 0, d_base = 0;
    int32_t *host_coords = NULL;
    float *host_feats = NULL;
    sp3d_tensor *new_t = NULL;
    int rc = -1;

    size_t in_coord_bytes = (size_t)inN * 4 * sizeof(int32_t);
    size_t in_feat_bytes = (size_t)inN * C_in * sizeof(float);
    size_t t_bytes = (size_t)dim * sizeof(float);
    if (cs3d_ensure_devbuf(&ws->d_in_coords, &ws->cap_in_coords, in_coord_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_in_feats,  &ws->cap_in_feats,  in_feat_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_t,         &ws->cap_t,         t_bytes) != 0)
        goto done;
    if (hipMemcpyHtoD(ws->d_in_coords, x->coords, in_coord_bytes) != hipSuccess ||
        hipMemcpyHtoD(ws->d_in_feats, x->feats, in_feat_bytes) != hipSuccess ||
        hipMemcpyHtoD(ws->d_t, t_emb, t_bytes) != hipSuccess)
        goto done;

    if (gb->updown == SAM3D_SLAT_UPDOWN_DOWN) {
        if (cs3d_ensure_devbuf(&ws->d_coords, &ws->cap_coords, in_coord_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_base,   &ws->cap_base,   in_feat_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_counts, &ws->cap_counts, (size_t)inN * sizeof(int)) != 0 ||
            cs3d_ensure_devbuf(&ws->d_outN,   &ws->cap_outN,   sizeof(int)) != 0)
            goto done;
        d_coords = ws->d_coords;
        d_base = ws->d_base;
        void *a_down[] = { &ws->d_in_coords, &ws->d_in_feats, &inN, &C_in,
                           &d_coords, &d_base, &ws->d_counts, &ws->d_outN };
        if (hipModuleLaunchKernel(fn->down, 1, 1, 1, 1, 1, 1, 0, 0, a_down, NULL) != hipSuccess)
            goto done;
        if (hipMemcpyDtoH(&outN, ws->d_outN, sizeof(int)) != hipSuccess ||
            outN <= 0 || outN > inN)
            goto done;
    } else if (gb->updown == SAM3D_SLAT_UPDOWN_UP) {
        size_t out_coord_bytes = (size_t)up_target_N * 4 * sizeof(int32_t);
        size_t base_bytes = (size_t)up_target_N * C_in * sizeof(float);
        if (cs3d_ensure_devbuf(&ws->d_coords, &ws->cap_coords, out_coord_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_base,   &ws->cap_base,   base_bytes) != 0)
            goto done;
        if (hipMemcpyHtoD(ws->d_coords, up_target_coords, out_coord_bytes) != hipSuccess)
            goto done;
        d_coords = ws->d_coords;
        d_base = ws->d_base;
        void *a_up[] = { &ws->d_in_coords, &ws->d_in_feats, &inN, &C_in,
                         &d_coords, &up_target_N, &d_base };
        if (hipModuleLaunchKernel(fn->up, (up_target_N + 127) / 128, 1, 1, 128, 1, 1, 0, 0, a_up, NULL) != hipSuccess)
            goto done;
    } else {
        d_coords = ws->d_in_coords;
        d_base = ws->d_in_feats;
    }

    size_t index_bytes = (size_t)64 * 64 * 64 * sizeof(int);
    size_t emb_bytes = (size_t)2 * C_out * sizeof(float);
    size_t skip_bytes = (size_t)outN * C_out * sizeof(float);
    size_t h1_bytes = (size_t)outN * C_in * sizeof(float);
    if (cs3d_ensure_devbuf(&ws->d_index,  &ws->cap_index,  index_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_t_silu, &ws->cap_t_silu, t_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_emb,    &ws->cap_emb,    emb_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_skip,   &ws->cap_skip,   skip_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h1,     &ws->cap_h1,     h1_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h2,     &ws->cap_h2,     skip_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h3,     &ws->cap_h3,     skip_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h4,     &ws->cap_h4,     skip_bytes) != 0)
        goto done;

    if (hipMemsetD8(ws->d_index, 0xff, index_bytes) != hipSuccess ||
        hipMemcpyDtoD(ws->d_t_silu, ws->d_t, t_bytes) != hipSuccess)
        goto done;
    void *a_idx[] = { &d_coords, &outN, &ws->d_index };
    if (hipModuleLaunchKernel(fn->idx, (outN + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_idx, NULL) != hipSuccess)
        goto done;
    void *a_s0[] = { &ws->d_t_silu, &dim };
    if (hipModuleLaunchKernel(fn->silu, (dim + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_s0, NULL) != hipSuccess)
        goto done;
    int twoCout = 2 * C_out, one = 1;
    { unsigned gx = 1, gy = (twoCout + 15) / 16;
      void *a[] = { &ws->d_emb, &ws->d_t_silu, &gb->emb_w, &gb->emb_b, &one, &dim, &twoCout };
      if (cs3d_slat_gemm(ctx, fn->gemm, a) != 0) goto done; }
    if (gb->has_skip) {
        unsigned gx = (outN + 15) / 16, gy = (C_out + 15) / 16;
        void *a[] = { &ws->d_skip, &d_base, &gb->skip_w, &gb->skip_b, &outN, &C_in, &C_out };
        if (cs3d_slat_gemm(ctx, fn->gemm, a) != 0) goto done;
    } else {
        if (C_in != C_out ||
            hipMemcpyDtoD(ws->d_skip, d_base, (size_t)outN * C_out * sizeof(float)) != hipSuccess)
            goto done;
    }

    int affine = 1;
    unsigned threads = 256;
    size_t ln_smem = 2 * threads * sizeof(float);
    int n_elem_in = outN * C_in;
    int n_elem_out = outN * C_out;
    int total_conv = outN * C_out;
    hipDeviceptr_t d_scale = ws->d_emb;
    hipDeviceptr_t d_shift = ws->d_emb + (size_t)C_out * sizeof(float);
    void *a_ln[] = { &ws->d_h1, &d_base, &gb->norm1_w, &gb->norm1_b,
                     &outN, &C_in, &ln_eps, &affine };
    if (hipModuleLaunchKernel(fn->ln, outN, 1, 1, threads, 1, 1, (unsigned)ln_smem, 0, a_ln, NULL) != hipSuccess)
        goto done;
    void *a_s1[] = { &ws->d_h1, &n_elem_in };
    if (hipModuleLaunchKernel(fn->silu, (n_elem_in + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_s1, NULL) != hipSuccess)
        goto done;
    void *a_c1[] = { &d_coords, &ws->d_h1, &ws->d_index, &gb->conv1_w, &gb->conv1_b,
                     &outN, &C_in, &C_out, &ws->d_h2 };
    if (hipModuleLaunchKernel(fn->conv, (total_conv + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_c1, NULL) != hipSuccess)
        goto done;
    void *a_ml[] = { &ws->d_h3, &ws->d_h2, &d_shift, &d_scale, &outN, &C_out, &ln_eps };
    if (hipModuleLaunchKernel(fn->modln, outN, 1, 1, threads, 1, 1, (unsigned)ln_smem, 0, a_ml, NULL) != hipSuccess)
        goto done;
    void *a_s2[] = { &ws->d_h3, &n_elem_out };
    if (hipModuleLaunchKernel(fn->silu, (n_elem_out + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_s2, NULL) != hipSuccess)
        goto done;
    void *a_c2[] = { &d_coords, &ws->d_h3, &ws->d_index, &gb->conv2_w, &gb->conv2_b,
                     &outN, &C_out, &C_out, &ws->d_h4 };
    if (hipModuleLaunchKernel(fn->conv, (total_conv + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_c2, NULL) != hipSuccess)
        goto done;
    void *a_ra[] = { &ws->d_h4, &ws->d_skip, &n_elem_out };
    if (hipModuleLaunchKernel(fn->resadd, (n_elem_out + 255) / 256, 1, 1, 256, 1, 1, 0, 0, a_ra, NULL) != hipSuccess)
        goto done;

    host_coords = (int32_t *)malloc((size_t)outN * 4 * sizeof(int32_t));
    host_feats = (float *)malloc((size_t)outN * C_out * sizeof(float));
    if (!host_coords || !host_feats) goto done;
    if (hipMemcpyDtoH(host_coords, d_coords, (size_t)outN * 4 * sizeof(int32_t)) != hipSuccess ||
        hipMemcpyDtoH(host_feats, ws->d_h4, (size_t)outN * C_out * sizeof(float)) != hipSuccess)
        goto done;
    new_t = sp3d_create(host_coords, host_feats, outN, C_out, x->batch_size);
    if (!new_t) goto done;
    sp3d_free(x);
    *xp = new_t;
    new_t = NULL;
    rc = 0;

done:
    if (new_t) sp3d_free(new_t);
    free(host_coords);
    free(host_feats);
    return rc;
}

static int cs3d_slat_input_layer_gpu_hook(void *user, void *xp_void,
                                          const void *input_w_void,
                                          const void *input_b_void,
                                          int out_channels)
{
    hip_sam3d_ctx *ctx = (hip_sam3d_ctx *)user;
    sp3d_tensor **xp = (sp3d_tensor **)xp_void;
    (void)input_w_void;
    (void)input_b_void;
    if (!ctx || !xp || !*xp || out_channels <= 0) return -1;
    sp3d_tensor *x = *xp;
    if (x->N <= 0 || x->C <= 0) return -1;
    if (cs3d_ensure_slat_io_gpu(ctx) != HIP_SAM3D_E_OK) return -1;
    if (x->C != ctx->gpu_slat_io.input_in ||
        out_channels != ctx->gpu_slat_io.input_out)
        return -1;

    cs3d_slat_io_ws *ws = &ctx->gpu_slat_io_ws;
    cs3d_slat_io_fns *fn = &ctx->gpu_slat_io_fns;
    int N = x->N;
    int C = x->C;
    int outC = out_channels;
    size_t in_bytes = (size_t)N * C * sizeof(float);
    size_t out_bytes = (size_t)N * outC * sizeof(float);
    float *host_feats = NULL;
    sp3d_tensor *new_t = NULL;
    int rc = -1;

    if (cs3d_ensure_devbuf(&ws->d_in_feats, &ws->cap_in_feats, in_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h1,       &ws->cap_h1,       out_bytes) != 0)
        goto done;
    if (hipMemcpyHtoD(ws->d_in_feats, x->feats, in_bytes) != hipSuccess)
        goto done;
    { unsigned gx = (N + 15) / 16, gy = (outC + 15) / 16;
      void *a[] = { &ws->d_h1, &ws->d_in_feats, &ctx->gpu_slat_io.input_w,
                    &ctx->gpu_slat_io.input_b, &N, &C, &outC };
      if (cs3d_slat_gemm(ctx, fn->gemm, a) != 0)
          goto done; }

