lighttransport/gemm/rdna4/sam3d/hip_sam3d_runner.c
    host_feats = (float *)malloc(out_bytes);
    if (!host_feats) goto done;
    if (hipMemcpyDtoH(host_feats, ws->d_h1, out_bytes) != hipSuccess)
        goto done;
    new_t = sp3d_create(x->coords, host_feats, N, outC, x->batch_size);
    if (!new_t) goto done;
    sp3d_free(x);
    *xp = new_t;
    new_t = NULL;
    rc = 0;

done:
    if (new_t) sp3d_free(new_t);
    free(host_feats);
    return rc;
}

static int cs3d_slat_final_layer_gpu_hook(void *user, void *xp_void,
                                          const void *out_w_void,
                                          const void *out_b_void,
                                          int out_channels, float eps)
{
    hip_sam3d_ctx *ctx = (hip_sam3d_ctx *)user;
    sp3d_tensor **xp = (sp3d_tensor **)xp_void;
    (void)out_w_void;
    (void)out_b_void;
    if (!ctx || !xp || !*xp || out_channels <= 0) return -1;
    sp3d_tensor *x = *xp;
    if (x->N <= 0 || x->C <= 0) return -1;
    if (cs3d_ensure_slat_io_gpu(ctx) != HIP_SAM3D_E_OK) return -1;
    if (x->C != ctx->gpu_slat_io.out_in ||
        out_channels != ctx->gpu_slat_io.out_out)
        return -1;

    cs3d_slat_io_ws *ws = &ctx->gpu_slat_io_ws;
    cs3d_slat_io_fns *fn = &ctx->gpu_slat_io_fns;
    int N = x->N;
    int C = x->C;
    int outC = out_channels;
    size_t in_bytes = (size_t)N * C * sizeof(float);
    size_t out_bytes = (size_t)N * outC * sizeof(float);
    float *host_feats = NULL;
    sp3d_tensor *new_t = NULL;
    int rc = -1;

    if (cs3d_ensure_devbuf(&ws->d_in_feats, &ws->cap_in_feats, in_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h1,       &ws->cap_h1,       in_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h2,       &ws->cap_h2,       out_bytes) != 0)
        goto done;
    if (hipMemcpyHtoD(ws->d_in_feats, x->feats, in_bytes) != hipSuccess)
        goto done;

    int affine = 0;
    unsigned threads = 256;
    size_t ln_smem = 2 * threads * sizeof(float);
    void *a_ln[] = { &ws->d_h1, &ws->d_in_feats,
                     &ctx->gpu_slat_io.out_w, &ctx->gpu_slat_io.out_b,
                     &N, &C, &eps, &affine };
    if (hipModuleLaunchKernel(fn->ln, N, 1, 1, threads, 1, 1,
                       (unsigned)ln_smem, 0, a_ln, NULL) != hipSuccess)
        goto done;

    { unsigned gx = (N + 15) / 16, gy = (outC + 15) / 16;
      void *a[] = { &ws->d_h2, &ws->d_h1, &ctx->gpu_slat_io.out_w,
                    &ctx->gpu_slat_io.out_b, &N, &C, &outC };
      if (cs3d_slat_gemm(ctx, fn->gemm, a) != 0)
          goto done; }

    host_feats = (float *)malloc(out_bytes);
    if (!host_feats) goto done;
    if (hipMemcpyDtoH(host_feats, ws->d_h2, out_bytes) != hipSuccess)
        goto done;
    new_t = sp3d_create(x->coords, host_feats, N, outC, x->batch_size);
    if (!new_t) goto done;
    sp3d_free(x);
    *xp = new_t;
    new_t = NULL;
    rc = 0;

done:
    if (new_t) sp3d_free(new_t);
    free(host_feats);
    return rc;
}

static int cs3d_slat_transformer_gpu_hook_impl(void *user, float *feats, int N,
                                               const int32_t *coords,
                                               const float *t_emb,
                                               const float *cond, int n_cond,
                                               int dim, int n_blocks,
                                               int apply_ape)
{
    hip_sam3d_ctx *ctx = (hip_sam3d_ctx *)user;
    if (!ctx || !feats || !t_emb || !cond || N <= 0 || n_cond <= 0 ||
        (apply_ape && !coords))
        return -1;
    if (cs3d_ensure_slatdit_gpu(ctx, N, n_cond) != HIP_SAM3D_E_OK)
        return -1;
    if (dim != ctx->gpu_slatdit.dim || n_blocks != ctx->gpu_slatdit.n_blocks)
        return -1;

    size_t x_bytes = (size_t)N * dim * sizeof(float);
    size_t coord_bytes = (size_t)N * 4 * sizeof(int32_t);
    size_t c_bytes = (size_t)n_cond * dim * sizeof(float);
    if (cs3d_ensure_devbuf(&ctx->d_slat_hook_x, &ctx->slat_hook_x_bytes, x_bytes) != 0 ||
        cs3d_ensure_devbuf(&ctx->d_slat_hook_t_emb, &ctx->slat_hook_t_emb_bytes,
                           (size_t)dim * sizeof(float)) != 0)
        return -1;
    if (hipMemcpyHtoD(ctx->d_slat_hook_x, feats, x_bytes) != hipSuccess ||
        hipMemcpyHtoD(ctx->d_slat_hook_t_emb, t_emb, (size_t)dim * sizeof(float)) != hipSuccess)
        return -1;
    if (apply_ape) {
        hipFunction_t ape_fn = NULL;
        int freq_dim = dim / 3 / 2;
        int filled = freq_dim * 2 * 3;
        long long total = (long long)N * filled;
        if (filled <= 0 ||
            cs3d_ensure_devbuf(&ctx->d_slat_hook_coords, &ctx->slat_hook_coords_bytes,
                               coord_bytes) != 0 ||
            hipModuleGetFunction(&ape_fn, ctx->mod, "slat_ape_add_f32") != hipSuccess)
            return -1;
        int coords_cached = 0;
        if (ctx->slat_hook_coords_cache &&
            ctx->slat_hook_coords_cache_bytes == coord_bytes &&
            memcmp(ctx->slat_hook_coords_cache, coords, coord_bytes) == 0) {
            coords_cached = 1;
        }
        if (!coords_cached) {
            int32_t *cache = (int32_t *)realloc(ctx->slat_hook_coords_cache,
                                                coord_bytes);
            if (!cache) return -1;
            memcpy(cache, coords, coord_bytes);
            ctx->slat_hook_coords_cache = cache;
            ctx->slat_hook_coords_cache_bytes = coord_bytes;
            if (hipMemcpyHtoD(ctx->d_slat_hook_coords, coords, coord_bytes) != hipSuccess)
                return -1;
        }
        void *a_ape[] = { &ctx->d_slat_hook_x, &ctx->d_slat_hook_coords, &N, &dim };
        if (hipModuleLaunchKernel(ape_fn, (unsigned)((total + 255) / 256), 1, 1,
                           256, 1, 1, 0, 0, a_ape, NULL) != hipSuccess)
            return -1;
    }

    int own_cond = 1;
    hipDeviceptr_t d_cond = 0;
    if (cond == ctx->cond_tokens.data && ctx->d_cond_tokens &&
        ctx->cond_tokens.n == n_cond && ctx->cond_tokens.c == dim) {
        d_cond = ctx->d_cond_tokens;
        own_cond = 0;
    } else {
        d_cond = hip_upload_raw(cond, c_bytes);
    }
    if (!d_cond) {
        if (d_cond && own_cond) hipFree(d_cond);
        return -1;
    }

    int ok = (cs3d_slatdit_stack_forward(&ctx->gpu_slatdit_fns,
                                         &ctx->gpu_slatdit_ws,
                                         &ctx->gpu_slatdit, 0, n_blocks,
                                         ctx->d_slat_hook_t_emb,
                                         ctx->d_slat_hook_x, N, d_cond,
                                         n_cond) == 0);
    if (ok && hipMemcpyDtoH(feats, ctx->d_slat_hook_x, x_bytes) != hipSuccess)
        ok = 0;
    if (own_cond) hipFree(d_cond);
    return ok ? 0 : -1;
}

static int cs3d_slat_ape_transformer_gpu_hook(void *user, float *feats, int N,
                                              const int32_t *coords,
                                              const float *t_emb,
                                              const float *cond, int n_cond,
                                              int dim, int n_blocks)
{
    return cs3d_slat_transformer_gpu_hook_impl(user, feats, N, coords, t_emb,
                                               cond, n_cond, dim, n_blocks, 1);
}

static int cs3d_slat_transformer_gpu_hook(void *user, float *feats, int N,
                                          const int32_t *coords,
                                          const float *t_emb,
                                          const float *cond, int n_cond,
                                          int dim, int n_blocks)
{
    return cs3d_slat_transformer_gpu_hook_impl(user, feats, N, coords, t_emb,
                                               cond, n_cond, dim, n_blocks, 0);
}

static int cs3d_adopt_slat(hip_sam3d_ctx *ctx, int32_t *coords, float *feats,
                           int n, int c)
{
    cs3d_free_slat(&ctx->slat_tokens);
    if (ctx->d_slat_feats)  { hipFree(ctx->d_slat_feats);  ctx->d_slat_feats  = 0; }
    if (ctx->d_slat_coords) { hipFree(ctx->d_slat_coords); ctx->d_slat_coords = 0; }
    if (!coords || !feats || n <= 0 || c <= 0) {
        free(coords); free(feats);
        return HIP_SAM3D_E_INVAL;
    }
    size_t f_bytes = (size_t)n * c * sizeof(float);
    size_t k_bytes = (size_t)n * 4 * sizeof(int32_t);
    ctx->d_slat_feats  = hip_upload_raw(feats,  f_bytes);
    ctx->d_slat_coords = hip_upload_raw(coords, k_bytes);
    if (!ctx->d_slat_feats || !ctx->d_slat_coords) {
        if (ctx->d_slat_feats)  { hipFree(ctx->d_slat_feats);  ctx->d_slat_feats  = 0; }
        if (ctx->d_slat_coords) { hipFree(ctx->d_slat_coords); ctx->d_slat_coords = 0; }
        free(coords); free(feats);
        return HIP_SAM3D_E_LOAD;
    }
    ctx->slat_tokens.feats  = feats;
    ctx->slat_tokens.coords = coords;
    ctx->slat_tokens.n      = n;
    ctx->slat_tokens.c      = c;
    return HIP_SAM3D_E_OK;
}

static int cs3d_slat_argwhere_gpu(hip_sam3d_ctx *ctx, const cs3d_host_nd *occ,
                                  int32_t **out_coords, int *out_n)
{
    if (!ctx || !occ || !occ->data || !out_coords || !out_n ||
        occ->ndim != 3 || occ->dims[0] <= 0 || occ->dims[1] <= 0 ||
        occ->dims[2] <= 0) return HIP_SAM3D_E_INVAL;

    hipFunction_t fn = NULL;
    if (hipModuleGetFunction(&fn, ctx->mod,
                            "slat_occ_argwhere_serial_f32") != hipSuccess) {
        fprintf(stderr, "hip_sam3d: missing slat_occ_argwhere_serial_f32\n");
        return HIP_SAM3D_E_LOAD;
    }

    int D = occ->dims[0], H = occ->dims[1], W = occ->dims[2];
    int occ_n = D * H * W;
    hipDeviceptr_t d_occ = 0, d_count = 0, d_coords = 0;
    int own_occ = 0;
    if (occ == &ctx->occupancy && ctx->d_occupancy) {
        d_occ = ctx->d_occupancy;
    } else {
        d_occ = hip_upload_raw(occ->data, (size_t)occ_n * sizeof(float));
        own_occ = 1;
        if (!d_occ) return HIP_SAM3D_E_LOAD;
    }
    if (hipMalloc(&d_count, sizeof(int)) != hipSuccess ||
        hipMalloc(&d_coords, (size_t)occ_n * 4 * sizeof(int32_t)) != hipSuccess) {
        if (d_count) hipFree(d_count);
        if (d_coords) hipFree(d_coords);
        if (own_occ) hipFree(d_occ);
        return HIP_SAM3D_E_LOAD;
    }

    void *args[] = { &d_occ, &D, &H, &W, &d_count, &d_coords };
    hipError_t lrc = hipModuleLaunchKernel(fn, 1, 1, 1, 1, 1, 1, 0, NULL, args, NULL);
    if (lrc == hipSuccess) lrc = hipDeviceSynchronize();
    int count = 0;
    if (lrc == hipSuccess)
        lrc = hipMemcpyDtoH(&count, d_count, sizeof(int));
    if (lrc != hipSuccess || count < 0 || count > occ_n) {
        hipFree(d_count);
        hipFree(d_coords);
        if (own_occ) hipFree(d_occ);
        return HIP_SAM3D_E_LOAD;
    }
    if (count == 0) {
        hipFree(d_count);
        hipFree(d_coords);
        if (own_occ) hipFree(d_occ);
        *out_coords = NULL;
        *out_n = 0;
        return HIP_SAM3D_E_OK;
    }

    int32_t *coords = (int32_t *)malloc((size_t)count * 4 * sizeof(int32_t));
    if (!coords) {
        hipFree(d_count);
        hipFree(d_coords);
        if (own_occ) hipFree(d_occ);
        return HIP_SAM3D_E_LOAD;
    }
    lrc = hipMemcpyDtoH(coords, d_coords, (size_t)count * 4 * sizeof(int32_t));
    hipFree(d_count);
    hipFree(d_coords);
    if (own_occ) hipFree(d_occ);
    if (lrc != hipSuccess) {
        free(coords);
        return HIP_SAM3D_E_LOAD;
    }
    *out_coords = coords;
    *out_n = count;
    return HIP_SAM3D_E_OK;
}

int hip_sam3d_run_slat_dit(hip_sam3d_ctx *ctx) {
    if (!ctx) return HIP_SAM3D_E_INVAL;
    const cs3d_host_2d *cond = cs3d_active_cond(ctx);
    if (!cond->data) {
        fprintf(stderr, "hip_sam3d: slat_dit needs cond tokens — "
                        "run cond_fuser (or override) first\n");
        return HIP_SAM3D_E_NO_INPUT;
    }
    const cs3d_host_nd *occ = cs3d_active_occupancy(ctx);
    if (!occ->data) {
        fprintf(stderr, "hip_sam3d: slat_dit needs occupancy — "
                        "run ss_decode (or override) first\n");
        return HIP_SAM3D_E_NO_INPUT;
    }
    if (occ->ndim != 3 || occ->dims[0] != 64 || occ->dims[1] != 64 ||
        occ->dims[2] != 64) {
        fprintf(stderr, "hip_sam3d: slat_dit expects occupancy [64,64,64], "
                        "got ndim=%d [%d,%d,%d]\n",
                occ->ndim, occ->dims[0], occ->dims[1], occ->dims[2]);
        return HIP_SAM3D_E_INVAL;
    }
    int rc = cs3d_ensure_slat_dit(ctx);
    if (rc != HIP_SAM3D_E_OK) return rc;

#if defined(_OPENMP)
    int nthr = omp_get_max_threads(); if (nthr < 1) nthr = 1;
#else
    int nthr = 1;
#endif
    int steps = ctx->cfg.slat_steps > 0 ? ctx->cfg.slat_steps : 12;

    int32_t *active_coords = NULL;
    int active_voxels = 0;
    rc = cs3d_slat_argwhere_gpu(ctx, occ, &active_coords, &active_voxels);
    if (rc != HIP_SAM3D_E_OK) return rc;
    if (ctx->cfg.verbose >= 1) {
        fprintf(stderr, "hip_sam3d: slat_dit active voxels=%d (gpu argwhere occ>0), steps=%d\n",
                active_voxels, steps);
    }
    if (active_voxels <= 0) {
        fprintf(stderr, "hip_sam3d: slat_dit occupancy is fully negative\n");
        free(active_coords);
        return HIP_SAM3D_E_LOAD;
    }

