lighttransport/gemm/rdna4/sam3d/hip_sam3d_runner.c
fail:
    cs3d_gs_head_gpu_free(&ctx->gpu_gs_head);
    return HIP_SAM3D_E_LOAD;
}

static int cs3d_adopt_gaussians(hip_sam3d_ctx *ctx, float *data, int n_total)
{
    cs3d_free_2d(&ctx->gaussians);
    if (ctx->d_gaussians) { hipFree(ctx->d_gaussians); ctx->d_gaussians = 0; }
    if (!data || n_total <= 0) { free(data); return HIP_SAM3D_E_INVAL; }
    size_t bytes = (size_t)n_total * HIP_SAM3D_GS_STRIDE * sizeof(float);
    ctx->d_gaussians = hip_upload_raw(data, bytes);
    if (!ctx->d_gaussians) { free(data); return HIP_SAM3D_E_LOAD; }
    ctx->gaussians.data = data;
    ctx->gaussians.n    = n_total;
    ctx->gaussians.c    = HIP_SAM3D_GS_STRIDE;
    return HIP_SAM3D_E_OK;
}

static int cs3d_gs_input_ape_gpu_hook(void *user,
                                      const int32_t *coords,
                                      const float *feats,
                                      int N, int in_channels,
                                      const void *input_w_void,
                                      const void *input_b_void,
                                      int dim,
                                      float **out_h)
{
    hip_sam3d_ctx *ctx = (hip_sam3d_ctx *)user;
    (void)input_w_void;
    (void)input_b_void;
    if (!ctx || !coords || !feats || !out_h || N <= 0 || in_channels <= 0 || dim <= 0)
        return -1;
    if (cs3d_ensure_gs_head_gpu(ctx) != HIP_SAM3D_E_OK) return -1;
    if (in_channels != ctx->gpu_gs_head.input_in ||
        dim != ctx->gpu_gs_head.input_out)
        return -1;
    hipFunction_t gemm = NULL, ape = NULL;
    if (hipModuleGetFunction(&gemm, ctx->mod, "gemm_f32_bias") != hipSuccess ||
        hipModuleGetFunction(&ape, ctx->mod, "slat_ape_add_f32") != hipSuccess)
        return -1;

    cs3d_gs_head_ws *ws = &ctx->gpu_gs_head_ws;
    size_t coord_bytes = (size_t)N * 4 * sizeof(int32_t);
    size_t in_bytes = (size_t)N * in_channels * sizeof(float);
    size_t h_bytes = (size_t)N * dim * sizeof(float);
    float *host_h = NULL;
    int rc = -1;
    if (cs3d_ensure_devbuf(&ws->d_coords, &ws->cap_coords, coord_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_in,     &ws->cap_in,     in_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h,      &ws->cap_h,      h_bytes) != 0)
        goto done;
    if (hipMemcpyHtoD(ws->d_coords, coords, coord_bytes) != hipSuccess ||
        hipMemcpyHtoD(ws->d_in, feats, in_bytes) != hipSuccess)
        goto done;
    { unsigned gx = (N + 15) / 16, gy = (dim + 15) / 16;
      void *a[] = { &ws->d_h, &ws->d_in, &ctx->gpu_gs_head.input_w,
                    &ctx->gpu_gs_head.input_b, &N, &in_channels, &dim };
      if (hipModuleLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != hipSuccess)
          goto done; }
    int freq_dim = dim / 3 / 2;
    int filled = freq_dim * 2 * 3;
    long long total = (long long)N * filled;
    void *a_ape[] = { &ws->d_h, &ws->d_coords, &N, &dim };
    if (hipModuleLaunchKernel(ape, (unsigned)((total + 255) / 256), 1, 1,
                       256, 1, 1, 0, 0, a_ape, NULL) != hipSuccess)
        goto done;
    host_h = (float *)malloc(h_bytes);
    if (!host_h) goto done;
    if (hipMemcpyDtoH(host_h, ws->d_h, h_bytes) != hipSuccess)
        goto done;
    *out_h = host_h;
    host_h = NULL;
    rc = 0;

done:
    free(host_h);
    return rc;
}

static int cs3d_gs_final_layer_gpu_hook(void *user,
                                        const float *h,
                                        int N, int dim,
                                        const void *out_w_void,
                                        const void *out_b_void,
                                        int out_channels,
                                        float eps,
                                        float **out_feats)
{
    hip_sam3d_ctx *ctx = (hip_sam3d_ctx *)user;
    (void)out_w_void;
    (void)out_b_void;
    if (!ctx || !h || !out_feats || N <= 0 || dim <= 0 || out_channels <= 0)
        return -1;
    if (cs3d_ensure_gs_head_gpu(ctx) != HIP_SAM3D_E_OK) return -1;
    if (dim != ctx->gpu_gs_head.out_in ||
        out_channels != ctx->gpu_gs_head.out_out)
        return -1;
    hipFunction_t gemm = NULL, ln = NULL;
    if (hipModuleGetFunction(&gemm, ctx->mod, "gemm_f32_bias") != hipSuccess ||
        hipModuleGetFunction(&ln, ctx->mod, "layernorm_token_f32") != hipSuccess)
        return -1;

    cs3d_gs_head_ws *ws = &ctx->gpu_gs_head_ws;
    size_t h_bytes = (size_t)N * dim * sizeof(float);
    size_t out_bytes = (size_t)N * out_channels * sizeof(float);
    float *host_out = NULL;
    int rc = -1;
    if (cs3d_ensure_devbuf(&ws->d_h,   &ws->cap_h,   h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_ln,  &ws->cap_ln,  h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_out, &ws->cap_out, out_bytes) != 0)
        goto done;
    if (hipMemcpyHtoD(ws->d_h, h, h_bytes) != hipSuccess)
        goto done;
    int affine = 0;
    unsigned threads = 256;
    size_t ln_smem = 2 * threads * sizeof(float);
    void *a_ln[] = { &ws->d_ln, &ws->d_h, &ctx->gpu_gs_head.out_w,
                     &ctx->gpu_gs_head.out_b, &N, &dim, &eps, &affine };
    if (hipModuleLaunchKernel(ln, N, 1, 1, threads, 1, 1,
                       (unsigned)ln_smem, 0, a_ln, NULL) != hipSuccess)
        goto done;
    { unsigned gx = (N + 15) / 16, gy = (out_channels + 15) / 16;
      void *a[] = { &ws->d_out, &ws->d_ln, &ctx->gpu_gs_head.out_w,
                    &ctx->gpu_gs_head.out_b, &N, &dim, &out_channels };
      if (hipModuleLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != hipSuccess)
          goto done; }
    host_out = (float *)malloc(out_bytes);
    if (!host_out) goto done;
    if (hipMemcpyDtoH(host_out, ws->d_out, out_bytes) != hipSuccess)
        goto done;
    *out_feats = host_out;
    host_out = NULL;
    rc = 0;

done:
    free(host_out);
    return rc;
}

static int cs3d_gs_mlp_gpu_hook(void *user,
                                float *h,
                                int N, int dim,
                                const void *blk_void,
                                int hidden,
                                float eps)
{
    hip_sam3d_ctx *ctx = (hip_sam3d_ctx *)user;
    const sam3d_gs_block *blk = (const sam3d_gs_block *)blk_void;
    if (!ctx || !h || !blk || N <= 0 || dim <= 0 || hidden <= 0)
        return -1;
    if (cs3d_ensure_gs_head_gpu(ctx) != HIP_SAM3D_E_OK) return -1;
    sam3d_gs_decoder_model *m =
        (sam3d_gs_decoder_model *)sam3d_cpu_gs_decoder_model(ctx->cpu_gs);
    if (!m || dim != ctx->gpu_gs_head.mlp_dim ||
        hidden != ctx->gpu_gs_head.mlp_hidden)
        return -1;
    int bi = (int)(blk - m->blocks);
    if (bi < 0 || bi >= ctx->gpu_gs_head.n_mlp_blocks)
        return -1;
    cs3d_gs_mlp_block_gpu *gb = &ctx->gpu_gs_head.mlp_blocks[bi];
    hipFunction_t gemm = NULL, ln = NULL, gelu = NULL, resadd = NULL;
    if (hipModuleGetFunction(&gemm, ctx->mod, "gemm_f32_bias") != hipSuccess ||
        hipModuleGetFunction(&ln, ctx->mod, "layernorm_token_f32") != hipSuccess ||
        hipModuleGetFunction(&gelu, ctx->mod, "gelu_tanh_inplace_f32") != hipSuccess ||
        hipModuleGetFunction(&resadd, ctx->mod, "residual_add_f32") != hipSuccess)
        return -1;

