lighttransport/gemm/rdna4/sam3d/hip_sam3d_runner.c
    cs3d_gs_head_ws *ws = &ctx->gpu_gs_head_ws;
    size_t h_bytes = (size_t)N * dim * sizeof(float);
    size_t qkv_bytes = (size_t)N * 3 * dim * sizeof(float);
    size_t mlp_bytes = (size_t)N * hidden * sizeof(float);
    size_t fwd_bytes = (size_t)N * sizeof(int);
    size_t win_bytes = (size_t)max_len * dim * sizeof(float);
    float scale = 1.0f / sqrtf((float)head_dim);
    int n_h = N * dim;
    int n_mlp = N * hidden;
    int rc = -1;

    if (cs3d_ensure_devbuf(&ws->d_h,    &ws->cap_h,    h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_ln,   &ws->cap_ln,   h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_qkv,  &ws->cap_qkv,  qkv_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_fwd,  &ws->cap_fwd,  fwd_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_attn, &ws->cap_attn, h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_out,  &ws->cap_out,  h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_q,    &ws->cap_q,    win_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_k,    &ws->cap_k,    win_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_v,    &ws->cap_v,    win_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_win,  &ws->cap_win,  win_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_mlp,  &ws->cap_mlp,  mlp_bytes) != 0)
        goto done;
    if (hipMemcpyHtoD(ws->d_h, h, h_bytes) != hipSuccess ||
        hipMemcpyHtoD(ws->d_fwd, fwd, fwd_bytes) != hipSuccess)
        goto done;

    int affine = 0;
    unsigned threads = 256;
    size_t ln_smem = 2 * threads * sizeof(float);
    void *a_ln1[] = { &ws->d_ln, &ws->d_h, &gb->out_w, &gb->out_b,
                      &N, &dim, &eps, &affine };
    if (hipModuleLaunchKernel(ln, N, 1, 1, threads, 1, 1,
                       (unsigned)ln_smem, 0, a_ln1, NULL) != hipSuccess)
        goto done;
    { int qkv_dim = 3 * dim;
      unsigned gx = (N + 15) / 16, gy = (qkv_dim + 15) / 16;
      void *a[] = { &ws->d_qkv, &ws->d_ln, &gb->qkv_w, &gb->qkv_b,
                    &N, &dim, &qkv_dim };
      if (hipModuleLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != hipSuccess)
          goto done; }

    for (int r = 0; r < n_runs; r++) {
        int start = runs[r].start;
        int len = runs[r].len;
        int elems = len * dim;
        void *a_g[] = { &ws->d_q, &ws->d_k, &ws->d_v, &ws->d_qkv,
                        &ws->d_fwd, &start, &len, &dim };
        if (hipModuleLaunchKernel(gather, (elems + 255) / 256, 1, 1,
                           256, 1, 1, 0, 0, a_g, NULL) != hipSuccess)
            goto done;
        size_t smem = (size_t)(256 + len) * sizeof(float);
        void *a_s[] = { &ws->d_win, &ws->d_q, &ws->d_k, &ws->d_v,
                        &len, &len, &n_heads, &head_dim, &scale };
        if (hipModuleLaunchKernel(sdpa, len, n_heads, 1,
                           256, 1, 1, (unsigned)smem, 0, a_s, NULL) != hipSuccess)
            goto done;
        void *a_sc[] = { &ws->d_attn, &ws->d_win, &ws->d_fwd,
                         &start, &len, &dim };
        if (hipModuleLaunchKernel(scatter, (elems + 255) / 256, 1, 1,
                           256, 1, 1, 0, 0, a_sc, NULL) != hipSuccess)
            goto done;
    }
    { unsigned gx = (N + 15) / 16, gy = (dim + 15) / 16;
      void *a[] = { &ws->d_out, &ws->d_attn, &gb->out_w, &gb->out_b,
                    &N, &dim, &dim };
      if (hipModuleLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != hipSuccess)
          goto done; }
    { void *a[] = { &ws->d_h, &ws->d_out, &n_h };
      if (hipModuleLaunchKernel(resadd, (n_h + 255) / 256, 1, 1,
                         256, 1, 1, 0, 0, a, NULL) != hipSuccess)
          goto done; }

    void *a_ln2[] = { &ws->d_ln, &ws->d_h, &gb->fc2_w, &gb->fc2_b,
                      &N, &dim, &eps, &affine };
    if (hipModuleLaunchKernel(ln, N, 1, 1, threads, 1, 1,
                       (unsigned)ln_smem, 0, a_ln2, NULL) != hipSuccess)
        goto done;
    { unsigned gx = (N + 15) / 16, gy = (hidden + 15) / 16;
      void *a[] = { &ws->d_mlp, &ws->d_ln, &gb->fc1_w, &gb->fc1_b,
                    &N, &dim, &hidden };
      if (hipModuleLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != hipSuccess)
          goto done; }
    { void *a[] = { &ws->d_mlp, &n_mlp };
      if (hipModuleLaunchKernel(gelu, (n_mlp + 255) / 256, 1, 1,
                         256, 1, 1, 0, 0, a, NULL) != hipSuccess)
          goto done; }
    { unsigned gx = (N + 15) / 16, gy = (dim + 15) / 16;
      void *a[] = { &ws->d_out, &ws->d_mlp, &gb->fc2_w, &gb->fc2_b,
                    &N, &hidden, &dim };
      if (hipModuleLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != hipSuccess)
          goto done; }
    { void *a[] = { &ws->d_h, &ws->d_out, &n_h };
      if (hipModuleLaunchKernel(resadd, (n_h + 255) / 256, 1, 1,
                         256, 1, 1, 0, 0, a, NULL) != hipSuccess)
          goto done; }

    if (hipMemcpyDtoH(h, ws->d_h, h_bytes) != hipSuccess)
        goto done;
    rc = 0;

done:
    free(fwd);
    free(runs);
    return rc;
}

static int cs3d_gs_stack_gpu_hook(void *user,
                                  float *h,
                                  const void *x_void,
                                  int N, int dim,
                                  const void *blocks_void,
                                  int n_blocks,
                                  int window_size,
                                  int n_heads,
                                  int head_dim,
                                  int hidden,
                                  float eps)
{
    hip_sam3d_ctx *ctx = (hip_sam3d_ctx *)user;
    const sp3d_tensor *x = (const sp3d_tensor *)x_void;
    const sam3d_gs_block *blocks = (const sam3d_gs_block *)blocks_void;
    if (!ctx || !h || !x || !x->coords || !blocks || N <= 0 || x->N != N ||
        dim <= 0 || hidden <= 0 || n_blocks <= 0 || window_size <= 0 ||
        n_heads <= 0 || head_dim <= 0 || dim != n_heads * head_dim)
        return -1;
    if (cs3d_ensure_gs_head_gpu(ctx) != HIP_SAM3D_E_OK) return -1;
    sam3d_gs_decoder_model *m =
        (sam3d_gs_decoder_model *)sam3d_cpu_gs_decoder_model(ctx->cpu_gs);
    if (!m || blocks != m->blocks || n_blocks != m->n_blocks ||
        dim != ctx->gpu_gs_head.mlp_dim ||
        hidden != ctx->gpu_gs_head.mlp_hidden)
        return -1;

    hipFunction_t gemm = NULL, ln = NULL, gather = NULL, scatter = NULL;
    hipFunction_t sdpa = NULL, resadd = NULL, gelu = NULL;
    if (hipModuleGetFunction(&gemm, ctx->mod, "gemm_f32_bias") != hipSuccess ||
        hipModuleGetFunction(&ln, ctx->mod, "layernorm_token_f32") != hipSuccess ||
        hipModuleGetFunction(&gather, ctx->mod, "sam3d_gs_gather_qkv_window_f32") != hipSuccess ||
        hipModuleGetFunction(&scatter, ctx->mod, "sam3d_gs_scatter_window_f32") != hipSuccess ||
        hipModuleGetFunction(&sdpa, ctx->mod, "sdpa_f32") != hipSuccess ||
        hipModuleGetFunction(&resadd, ctx->mod, "residual_add_f32") != hipSuccess ||
        hipModuleGetFunction(&gelu, ctx->mod, "gelu_tanh_inplace_f32") != hipSuccess)
        return -1;

