lighttransport/gemm/rdna4/sam3d/hip_sam3d_runner.c
    int N = x->N;
    int in_channels = x->C;
    int dim = m->dim;
    int hidden = ctx->gpu_gs_head.mlp_hidden;
    int n_heads = m->n_heads;
    int head_dim = m->head_dim;
    int window_size = m->window_size;
    int out_channels = m->out_channels;
    if (in_channels != ctx->gpu_gs_head.input_in ||
        dim != ctx->gpu_gs_head.input_out ||
        dim != ctx->gpu_gs_head.mlp_dim ||
        dim != n_heads * head_dim ||
        out_channels != ctx->gpu_gs_head.out_out ||
        hidden <= 0)
        return -1;

    hipFunction_t gemm = NULL, ape = NULL, ln = NULL, gather = NULL;
    hipFunction_t scatter = NULL, sdpa = NULL, resadd = NULL, gelu = NULL;
    if (hipModuleGetFunction(&gemm, ctx->mod, "gemm_f32_bias") != hipSuccess ||
        hipModuleGetFunction(&ape, ctx->mod, "slat_ape_add_f32") != hipSuccess ||
        hipModuleGetFunction(&ln, ctx->mod, "layernorm_token_f32") != hipSuccess ||
        hipModuleGetFunction(&gather, ctx->mod, "sam3d_gs_gather_qkv_window_f32") != hipSuccess ||
        hipModuleGetFunction(&scatter, ctx->mod, "sam3d_gs_scatter_window_f32") != hipSuccess ||
        hipModuleGetFunction(&sdpa, ctx->mod, "sdpa_f32") != hipSuccess ||
        hipModuleGetFunction(&resadd, ctx->mod, "residual_add_f32") != hipSuccess ||
        hipModuleGetFunction(&gelu, ctx->mod, "gelu_tanh_inplace_f32") != hipSuccess)
        return -1;

    cs3d_gs_head_ws *ws = &ctx->gpu_gs_head_ws;
    size_t coord_bytes = (size_t)N * 4 * sizeof(int32_t);
    size_t in_bytes = (size_t)N * in_channels * sizeof(float);
    size_t h_bytes = (size_t)N * dim * sizeof(float);
    size_t qkv_bytes = (size_t)N * 3 * dim * sizeof(float);
    size_t mlp_bytes = (size_t)N * hidden * sizeof(float);
    size_t fwd_bytes = (size_t)N * sizeof(int);
    size_t out_bytes = (size_t)N * out_channels * sizeof(float);
    int n_h = N * dim;
    int n_mlp = N * hidden;
    int affine = 0;
    unsigned threads = 256;
    size_t ln_smem = 2 * threads * sizeof(float);
    float eps_block = 1e-6f;
    float eps_final = 1e-5f;
    float *host_out = NULL;
    int rc = -1;

    if (cs3d_ensure_devbuf(&ws->d_coords, &ws->cap_coords, coord_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_in,     &ws->cap_in,     in_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_h,      &ws->cap_h,      h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_ln,     &ws->cap_ln,     h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_qkv,    &ws->cap_qkv,    qkv_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_fwd,    &ws->cap_fwd,    fwd_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_attn,   &ws->cap_attn,   h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_out,    &ws->cap_out,    h_bytes) != 0 ||
        cs3d_ensure_devbuf(&ws->d_mlp,    &ws->cap_mlp,    mlp_bytes) != 0)
        goto done;
    if (src_d_coords) {
        if (hipMemcpyDtoD(ws->d_coords, src_d_coords, coord_bytes) != hipSuccess)
            goto done;
    } else if (hipMemcpyHtoD(ws->d_coords, x->coords, coord_bytes) != hipSuccess) {
        goto done;
    }
    if (src_d_feats) {
        if (hipMemcpyDtoD(ws->d_in, src_d_feats, in_bytes) != hipSuccess)
            goto done;
    } else if (hipMemcpyHtoD(ws->d_in, x->feats, in_bytes) != hipSuccess) {
        goto done;
    }

    { unsigned gx = (N + 15) / 16, gy = (dim + 15) / 16;
      void *a[] = { &ws->d_h, &ws->d_in, &ctx->gpu_gs_head.input_w,
                    &ctx->gpu_gs_head.input_b, &N, &in_channels, &dim };
      if (hipModuleLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != hipSuccess)
          goto done; }
    {
      int freq_dim = dim / 3 / 2;
      int filled = freq_dim * 2 * 3;
      long long total = (long long)N * filled;
      void *a_ape[] = { &ws->d_h, &ws->d_coords, &N, &dim };
      if (filled <= 0 ||
          hipModuleLaunchKernel(ape, (unsigned)((total + 255) / 256), 1, 1,
                         256, 1, 1, 0, 0, a_ape, NULL) != hipSuccess)
          goto done;
    }

    for (int bi = 0; bi < m->n_blocks; bi++) {
        cs3d_gs_mlp_block_gpu *gb = &ctx->gpu_gs_head.mlp_blocks[bi];
        int shift_v = (bi & 1) ? (window_size / 2) : 0;
        int shift[3] = {shift_v, shift_v, shift_v};
        int *fwd = NULL;
        cs3d_gs_win_run *runs = NULL;
        int n_runs = 0, max_len = 0;
        if (cs3d_gs_build_partition(x, window_size, shift, &fwd, &runs,
                                    &n_runs, &max_len) != 0)
            goto done;

        size_t win_bytes = (size_t)max_len * dim * sizeof(float);
        float scale = 1.0f / sqrtf((float)head_dim);
        if (cs3d_ensure_devbuf(&ws->d_q,   &ws->cap_q,   win_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_k,   &ws->cap_k,   win_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_v,   &ws->cap_v,   win_bytes) != 0 ||
            cs3d_ensure_devbuf(&ws->d_win, &ws->cap_win, win_bytes) != 0 ||
            hipMemcpyHtoD(ws->d_fwd, fwd, fwd_bytes) != hipSuccess) {
            free(fwd); free(runs); goto done;
        }

        void *a_ln1[] = { &ws->d_ln, &ws->d_h, &gb->out_w, &gb->out_b,
                          &N, &dim, &eps_block, &affine };
        if (hipModuleLaunchKernel(ln, N, 1, 1, threads, 1, 1,
                           (unsigned)ln_smem, 0, a_ln1, NULL) != hipSuccess) {
            free(fwd); free(runs); goto done;
        }
        { int qkv_dim = 3 * dim;
          unsigned gx = (N + 15) / 16, gy = (qkv_dim + 15) / 16;
          void *a[] = { &ws->d_qkv, &ws->d_ln, &gb->qkv_w, &gb->qkv_b,
                        &N, &dim, &qkv_dim };
          if (hipModuleLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != hipSuccess) {
              free(fwd); free(runs); goto done;
          } }

        for (int r = 0; r < n_runs; r++) {
            int start = runs[r].start;
            int len = runs[r].len;
            int elems = len * dim;
            void *a_g[] = { &ws->d_q, &ws->d_k, &ws->d_v, &ws->d_qkv,
                            &ws->d_fwd, &start, &len, &dim };
            if (hipModuleLaunchKernel(gather, (elems + 255) / 256, 1, 1,
                               256, 1, 1, 0, 0, a_g, NULL) != hipSuccess) {
                free(fwd); free(runs); goto done;
            }
            size_t smem = (size_t)(256 + len) * sizeof(float);
            void *a_s[] = { &ws->d_win, &ws->d_q, &ws->d_k, &ws->d_v,
                            &len, &len, &n_heads, &head_dim, &scale };
            if (hipModuleLaunchKernel(sdpa, len, n_heads, 1,
                               256, 1, 1, (unsigned)smem, 0, a_s, NULL) != hipSuccess) {
                free(fwd); free(runs); goto done;
            }
            void *a_sc[] = { &ws->d_attn, &ws->d_win, &ws->d_fwd,
                             &start, &len, &dim };
            if (hipModuleLaunchKernel(scatter, (elems + 255) / 256, 1, 1,
                               256, 1, 1, 0, 0, a_sc, NULL) != hipSuccess) {
                free(fwd); free(runs); goto done;
            }
        }
        free(fwd);
        free(runs);

        { unsigned gx = (N + 15) / 16, gy = (dim + 15) / 16;
          void *a[] = { &ws->d_out, &ws->d_attn, &gb->out_w, &gb->out_b,
                        &N, &dim, &dim };
          if (hipModuleLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != hipSuccess)
              goto done; }
        { void *a[] = { &ws->d_h, &ws->d_out, &n_h };
          if (hipModuleLaunchKernel(resadd, (n_h + 255) / 256, 1, 1,
                             256, 1, 1, 0, 0, a, NULL) != hipSuccess)
              goto done; }

        void *a_ln2[] = { &ws->d_ln, &ws->d_h, &gb->fc2_w, &gb->fc2_b,
                          &N, &dim, &eps_block, &affine };
        if (hipModuleLaunchKernel(ln, N, 1, 1, threads, 1, 1,
                           (unsigned)ln_smem, 0, a_ln2, NULL) != hipSuccess)
            goto done;
        { unsigned gx = (N + 15) / 16, gy = (hidden + 15) / 16;
          void *a[] = { &ws->d_mlp, &ws->d_ln, &gb->fc1_w, &gb->fc1_b,
                        &N, &dim, &hidden };
          if (hipModuleLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != hipSuccess)
              goto done; }
        { void *a[] = { &ws->d_mlp, &n_mlp };
          if (hipModuleLaunchKernel(gelu, (n_mlp + 255) / 256, 1, 1,
                             256, 1, 1, 0, 0, a, NULL) != hipSuccess)
              goto done; }
        { unsigned gx = (N + 15) / 16, gy = (dim + 15) / 16;
          void *a[] = { &ws->d_out, &ws->d_mlp, &gb->fc2_w, &gb->fc2_b,
                        &N, &hidden, &dim };
          if (hipModuleLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != hipSuccess)
              goto done; }
        { void *a[] = { &ws->d_h, &ws->d_out, &n_h };
          if (hipModuleLaunchKernel(resadd, (n_h + 255) / 256, 1, 1,
                             256, 1, 1, 0, 0, a, NULL) != hipSuccess)
              goto done; }
    }

    void *a_lnf[] = { &ws->d_ln, &ws->d_h, &ctx->gpu_gs_head.out_w,
                      &ctx->gpu_gs_head.out_b, &N, &dim, &eps_final, &affine };
    if (hipModuleLaunchKernel(ln, N, 1, 1, threads, 1, 1,
                       (unsigned)ln_smem, 0, a_lnf, NULL) != hipSuccess)
        goto done;
    { unsigned gx = (N + 15) / 16, gy = (out_channels + 15) / 16;
      void *a[] = { &ws->d_out, &ws->d_ln, &ctx->gpu_gs_head.out_w,
                    &ctx->gpu_gs_head.out_b, &N, &dim, &out_channels };
      if (hipModuleLaunchKernel(gemm, gx, gy, 1, 16, 16, 1, 0, 0, a, NULL) != hipSuccess)
          goto done; }

    if (out_feats) {
        host_out = (float *)malloc(out_bytes);
        if (!host_out) goto done;
        if (hipMemcpyDtoH(host_out, ws->d_out, out_bytes) != hipSuccess)
            goto done;
        *out_feats = host_out;
        host_out = NULL;
    }
    rc = 0;

done:
    free(host_out);
    return rc;
}

static int cs3d_gs_transformer_gpu_hook(void *user,
                                        const void *x_void,
                                        const void *m_void,
                                        float **out_feats)
{
    return cs3d_gs_transformer_gpu_forward((hip_sam3d_ctx *)user,
                                           (const sp3d_tensor *)x_void,
                                           (const sam3d_gs_decoder_model *)m_void,
                                           0, 0,
                                           out_feats);
}

int hip_sam3d_debug_slat_gs_transformer(hip_sam3d_ctx *ctx,
                                         const int32_t *coords,
                                         const float *feats, int N,
                                         float **out_feats, int *out_c)
{
    if (!ctx || !coords || !feats || N <= 0 || !out_feats) return HIP_SAM3D_E_INVAL;
    int rc = cs3d_ensure_gs(ctx);
    if (rc != HIP_SAM3D_E_OK) return rc;
#if defined(_OPENMP)
    int nthr = omp_get_max_threads(); if (nthr < 1) nthr = 1;
#else
    int nthr = 1;
#endif
    sam3d_cpu_gs_decoder_set_input_ape_hook(cs3d_gs_input_ape_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_final_layer_hook(cs3d_gs_final_layer_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_window_attn_hook(cs3d_gs_window_attn_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_attn_block_hook(cs3d_gs_attn_block_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_mlp_hook(cs3d_gs_mlp_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_block_hook(cs3d_gs_block_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_stack_hook(cs3d_gs_stack_gpu_hook, ctx);
    sam3d_cpu_gs_decoder_set_transformer_hook(cs3d_gs_transformer_gpu_hook, ctx);
    float *out = sam3d_cpu_gs_decoder_transformer(ctx->cpu_gs, coords, feats,
                                                  N, nthr);
    sam3d_cpu_gs_decoder_set_transformer_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_stack_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_block_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_mlp_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_attn_block_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_window_attn_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_final_layer_hook(NULL, NULL);
    sam3d_cpu_gs_decoder_set_input_ape_hook(NULL, NULL);
    if (!out) return HIP_SAM3D_E_LOAD;
    *out_feats = out;
    if (out_c) *out_c = sam3d_cpu_gs_decoder_out_channels(ctx->cpu_gs);
    return HIP_SAM3D_E_OK;
}

