lighttransport/gemm/rdna4/sam3d/hip_sam3d_runner.c
int hip_sam3d_debug_slat_gs_to_representation(hip_sam3d_ctx *ctx,
                                               const int32_t *coords,
                                               const float *feats_out, int N,
                                               float *xyz_out, float *dc_out,
                                               float *scaling_out, float *rotation_out,
                                               float *opacity_out)
{
    if (!ctx) return HIP_SAM3D_E_INVAL;
    int rc = cs3d_ensure_gs(ctx);
    if (rc != HIP_SAM3D_E_OK) return rc;
    return sam3d_cpu_gs_decoder_to_representation(ctx->cpu_gs, coords, feats_out, N,
                                                  xyz_out, dc_out,
                                                  scaling_out, rotation_out,
                                                  opacity_out) == 0
           ? HIP_SAM3D_E_OK : HIP_SAM3D_E_LOAD;
}

int hip_sam3d_slat_gs_info(hip_sam3d_ctx *ctx,
                            int *out_in_channels, int *out_out_channels,
                            int *out_num_gaussians)
{
    if (!ctx) return HIP_SAM3D_E_INVAL;
    int rc = cs3d_ensure_gs(ctx);
    if (rc != HIP_SAM3D_E_OK) return rc;
    if (out_in_channels)   *out_in_channels   = sam3d_cpu_gs_decoder_in_channels  (ctx->cpu_gs);
    if (out_out_channels)  *out_out_channels  = sam3d_cpu_gs_decoder_out_channels (ctx->cpu_gs);
    if (out_num_gaussians) *out_num_gaussians = sam3d_cpu_gs_decoder_num_gaussians(ctx->cpu_gs);
    return HIP_SAM3D_E_OK;
}

static int cs3d_gs_pack_ply_gpu_device(hip_sam3d_ctx *ctx,
                                       const sam3d_gs_decoder_model *m,
                                       hipDeviceptr_t d_coords,
                                       hipDeviceptr_t d_feats,
                                       int N,
                                       float **out_ply,
                                       int *out_total)
{
    if (!ctx || !m || !d_coords || !d_feats || N <= 0 || !out_ply || !out_total)
        return HIP_SAM3D_E_INVAL;
    hipFunction_t fn = NULL;
    if (hipModuleGetFunction(&fn, ctx->mod, "sam3d_gs_pack_ply_f32") != hipSuccess) {
        fprintf(stderr, "hip_sam3d: missing sam3d_gs_pack_ply_f32\n");
        return HIP_SAM3D_E_LOAD;
    }

    int C = m->out_channels;
    int G = m->num_gaussians;
    int stride = HIP_SAM3D_GS_STRIDE;
    int total = N * G;
    size_t ply_bytes = (size_t)total * stride * sizeof(float);
    hipDeviceptr_t d_ply = 0, d_perturb = 0;
    float *ply = NULL;
    int rc = HIP_SAM3D_E_LOAD;

    if (hipMalloc(&d_ply, ply_bytes) != hipSuccess)
        goto done;

    int has_perturb = (m->perturb_offset && m->offset_perturbation.data) ? 1 : 0;
    if (has_perturb &&
        cs3d_slat_io_upload_qtensor(&m->offset_perturbation,
                                    "gs.offset_perturbation",
                                    &d_perturb, NULL) != 0)
        goto done;

    int resolution = m->resolution;
    float voxel_size = m->voxel_size;
    float scaling_bias = m->scaling_bias;
    float opacity_bias = m->opacity_bias;
    int r_xyz0 = m->r_xyz[0];
    int r_dc0 = m->r_features_dc[0];
    int r_scl0 = m->r_scaling[0];
    int r_rot0 = m->r_rotation[0];
    int r_op0 = m->r_opacity[0];
    float lr_xyz = m->lr_xyz;
    float lr_features_dc = m->lr_features_dc;
    float lr_scaling = m->lr_scaling;
    float lr_rotation = m->lr_rotation;
    float lr_opacity = m->lr_opacity;
    void *args[] = { &d_ply, &d_coords, &d_feats, &d_perturb, &has_perturb,
                     &N, &C, &G, &stride, &resolution,
                     &voxel_size, &scaling_bias, &opacity_bias,
                     &r_xyz0, &r_dc0, &r_scl0, &r_rot0, &r_op0,
                     &lr_xyz, &lr_features_dc, &lr_scaling,
                     &lr_rotation, &lr_opacity };
    if (hipModuleLaunchKernel(fn, (total + 255) / 256, 1, 1,
                       256, 1, 1, 0, 0, args, NULL) != hipSuccess)
        goto done;
    ply = (float *)malloc(ply_bytes);
    if (!ply) goto done;
    if (hipMemcpyDtoH(ply, d_ply, ply_bytes) != hipSuccess)
        goto done;
    *out_ply = ply;
    *out_total = total;
    ply = NULL;
    rc = HIP_SAM3D_E_OK;

done:
    free(ply);
    if (d_ply) hipFree(d_ply);
    if (d_perturb) hipFree(d_perturb);
    return rc;
}

static int cs3d_gs_pack_ply_gpu(hip_sam3d_ctx *ctx,
                                const sam3d_gs_decoder_model *m,
                                const int32_t *coords,
                                const float *feats_out,
                                int N,
                                float **out_ply,
                                int *out_total)
{
    if (!ctx || !m || !coords || !feats_out || N <= 0 || !out_ply || !out_total)
        return HIP_SAM3D_E_INVAL;

    int C = m->out_channels;
    size_t coord_bytes = (size_t)N * 4 * sizeof(int32_t);
    size_t feat_bytes = (size_t)N * C * sizeof(float);
    hipDeviceptr_t d_coords = hip_upload_raw(coords, coord_bytes);
    hipDeviceptr_t d_feats = hip_upload_raw(feats_out, feat_bytes);
    if (!d_coords || !d_feats) {
        if (d_coords) hipFree(d_coords);
        if (d_feats) hipFree(d_feats);
        return HIP_SAM3D_E_LOAD;
    }

    int rc = cs3d_gs_pack_ply_gpu_device(ctx, m, d_coords, d_feats, N,
                                         out_ply, out_total);
    hipFree(d_coords);
    hipFree(d_feats);
    return rc;
}

int hip_sam3d_debug_slat_gs_pack_ply(hip_sam3d_ctx *ctx,
                                      const int32_t *coords,
                                      const float *feats_out, int N,
                                      float **out_ply, int *out_total)
{
    if (!ctx || !coords || !feats_out || N <= 0 || !out_ply || !out_total)
        return HIP_SAM3D_E_INVAL;
    int rc = cs3d_ensure_gs(ctx);
    if (rc != HIP_SAM3D_E_OK) return rc;
    sam3d_gs_decoder_model *gm =
        (sam3d_gs_decoder_model *)sam3d_cpu_gs_decoder_model(ctx->cpu_gs);
    return cs3d_gs_pack_ply_gpu(ctx, gm, coords, feats_out, N,
                                out_ply, out_total);
}

int hip_sam3d_run_slat_gs_decode(hip_sam3d_ctx *ctx) {
    if (!ctx) return HIP_SAM3D_E_INVAL;
    const cs3d_host_slat *slat = cs3d_active_slat(ctx);
    if (!slat->feats || !slat->coords) {
        fprintf(stderr, "hip_sam3d: slat_gs_decode needs SLAT tokens — "
                        "run slat_dit (or override) first\n");
        return HIP_SAM3D_E_NO_INPUT;
    }
    int rc = cs3d_ensure_gs(ctx);
    if (rc != HIP_SAM3D_E_OK) return rc;

    int N = slat->n;
    int G = sam3d_cpu_gs_decoder_num_gaussians(ctx->cpu_gs);
    int total = N * G;

    sam3d_gs_decoder_model *gm =
        (sam3d_gs_decoder_model *)sam3d_cpu_gs_decoder_model(ctx->cpu_gs);
    sp3d_tensor x = {0};
    x.coords = (int32_t *)slat->coords;
    x.feats = (float *)slat->feats;
    x.N = N;
    x.C = slat->c;
    x.batch_size = 1;

